dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
<head>
<!-- 2016-12-19 Mon 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dramatically Reducing Software Vulnerabilities</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ronaldo Ferreira de Lima" />
<meta name="description" content="The call for a dramatic reduction in software vulnerability is heard from multiple sources, recently from the February 2016 Federal Cybersecurity Research and Development Strategic Plan. This plan starts by describing well known risks: current systems perform increasingly vital tasks and are widely known to possess vulnerabilities. These vulnerabilities are often not easy to discover and difficult to correct. Cybersecurity has not kept pace, and the pace that is needed is rapidly accelerating. The goal of this report is to present a list of specific technical approaches that have the potential to make a dramatic difference in reducing vulnerabilities -- by stopping them before they occur, by finding them before they are exploited or by reducing their impact."
 />
<meta name="keywords" content="Measurement; metrics; software assurance; software measures, security vulnerabilities; reduce software vulnerability" />
</head>
<body>
<div id="content">
<h1 class="title">Dramatically Reducing Software Vulnerabilities</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd54a904">Dramatically Reducing Software Vulnerabilities</a>
<ul>
<li><a href="#org2d454f7">Abstract</a></li>
<li><a href="#org181a423">1 Introduction</a>
<ul>
<li><a href="#orgf4abd09">1.1 Scope of Report</a></li>
<li><a href="#orga85c87c">1.2 Findings</a></li>
<li><a href="#org696acbe">1.3 Audience</a></li>
<li><a href="#org6717ef0">1.4 Measures</a></li>
<li><a href="#org7e74fc1">1.5 Methodology</a></li>
<li><a href="#org53a5a70">1.6 Report Organization</a></li>
</ul>
</li>
<li><a href="#org25be9c6">2 Technical Approaches</a>
<ul>
<li><a href="#org3199ba9">2.1 Formal Methods</a></li>
<li><a href="#orgc45552f">2.2 System Level Security</a></li>
<li><a href="#org6aefe7e">2.3 Additive Software Analysis Techniques</a></li>
<li><a href="#org42b7bd4">2.4 More Mature Domain-Specific Software Development Frameworks</a></li>
<li><a href="#orgb8998b1">2.5 Moving Target Defenses (MTD) and Automatic Software Diversity</a></li>
</ul>
</li>
<li><a href="#orgf61e253">3 Measures and Metrics</a>
<ul>
<li><a href="#org5be349c">3.1 A Taxonomy of Software Measures</a></li>
<li><a href="#orge7ba6ef">3.2 Software Assurance: The Object of Software Measures</a></li>
<li><a href="#orgab9e9fa">3.3 Software Metrology</a></li>
<li><a href="#orged91d21">3.4 Product Measures</a></li>
<li><a href="#org1c7d070">3.5 Further Reading</a></li>
</ul>
</li>
<li><a href="#org6520570">4 Non-Technical Approaches and Summary</a>
<ul>
<li><a href="#orgd0c0632">4.1 Engaging the Research Community</a></li>
<li><a href="#org2ab8893">4.2 Education and Training</a></li>
<li><a href="#orgdb79b66">4.3 Consumer-Enabling Technology Transfer</a></li>
<li><a href="#orgd1d6e53">4.4 Conclusions</a></li>
<li><a href="#org2eb1cf9">4.5 Table of Acronyms</a></li>
</ul>
</li>
<li><a href="#orgb4a06e0">5 References</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd54a904" class="outline-2">
<h2 id="orgd54a904">Dramatically Reducing Software Vulnerabilities</h2>
<div class="outline-text-2" id="text-orgd54a904">
<p>
Report to the White House Office of Science and Technology Policy<br  />
</p>

<p>
Paul E. Black<br  />
Lee Badger<br  />
Barbara Guttman<br  />
Elizabeth Fong<br  />
Information Technology Laboratory<br  />
</p>

<p>
This publication is available free of charge from:<br  />
<a href="https://doi.org/10.6028/NIST.IR.8151">https://doi.org/10.6028/NIST.IR.8151</a><br  />
</p>

<p>
November 2016<br  />
</p>

<p>
U.S. Department of Commerce Penny Pritzker, Secretary<br  />
</p>

<p>
National Institute of Standards and Technology Willie May, Under Secretary of Commerce for Standards and Technology and Director National Institute of Standards and Technology Interagency Report 8151<br  />
64 pages (November 2016)<br  />
</p>

<p>
Certain commercial entities, equipment, or materials may be identified in this document in order to describe an experimental procedure or concept adequately. Such identification is not intended to imply recommendation or endorsement by NIST, nor is it intended to imply that the entities, materials, or equipment are necessarily the best available for the purpose.<br  />
</p>

<p>
There may be references in this publication to other publications currently under development by NIST in accordance with its assigned statutory responsibilities. The information in this publication, including concepts and methodologies, may be used by federal agencies even before the completion of such companion publications. Thus, until each publication is completed, current requirements, guidelines, and procedures, where they exist, remain operative. For planning and transition purposes, federal agencies may wish to closely follow the development of these new publications by NIST.<br  />
</p>

<p>
Organizations are encouraged to review all draft publications during public comment periods and provide feedback to NIST. Many NIST cybersecurity publications, other than the ones noted above, are available at <a href="http://csrc.nist.gov/publications">http://csrc.nist.gov/publications</a>.<br  />
</p>

<p>
Comments on this publication may be submitted to:<br  />
</p>

<p>
National Institute of Standards and Technology<br  />
Attn: Software and Systems Division, Information Technology Laboratory<br  />
100 Bureau Drive (Mail Stop 8970) Gaithersburg, MD 20899-8970<br  />
Email: paul.black@nist.gov<br  />
</p>

<p>
All comments are subject to release under the Freedom of Information Act (FOIA).<br  />
</p>
</div>

<div id="outline-container-org2d454f7" class="outline-3">
<h3 id="org2d454f7">Abstract</h3>
<div class="outline-text-3" id="text-org2d454f7">
<p>
The call for a dramatic reduction in software vulnerability is heard from multiple sources, recently from the February 2016 Federal Cybersecurity Research and Development Strategic Plan. This plan starts by describing well known risks: current systems perform increasingly vital tasks and are widely known to possess vulnerabilities. These vulnerabilities are often not easy to discover and difficult to correct. Cybersecurity has not kept pace, and the pace that is needed is rapidly accelerating. The goal of this report is to present a list of specific technical approaches that have the potential to make a dramatic difference in reducing vulnerabilities - by stopping them before they occur, by finding them before they are exploited or by reducing their impact.<br  />
</p>

<p>
Keywords:<br  />
</p>

<p>
Measurement; metrics; software assurance; software measures, security vulnerabilities; reduce software vulnerability.<br  />
</p>

<p>
Acknowledgements:<br  />
</p>

<p>
Many thanks to Rajeev Joshi (rajeev.joshi@jpl.nasa.gov) for contributions to Sect. <a href="#org88e5ece">2.3</a> Additive Software Analysis Techniques.<br  />
</p>

<p>
Thanks also to W. Konrad Vesey (william.k.vesey.ctr@mail.mil), Contractor, MIT Lincoln Laboratory, Office of the Assistant Secretary of Defense, Research and Engineering, for material in Sect. <a href="#orgd88a993">2.5</a> Moving Target Defense (MTD) and Automatic Software Diversity]]. Much of the wording is directly from a private communication from him.<br  />
</p>

<p>
We thank Terry Cohen, Mark Cornwell, John Diamant, Jeremy Epstein, D. Richard Kuhn, Andrew Murren, Kenneth S Thompson, Jan Vandenbos, David Wheeler and Lok Yan for their significant comments and suggestions, which greatly improved this report. We also thank the many others who suggested improvements, asked questions and submitted comments.<br  />
</p>
</div>
</div>
