dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-org181a423" class="outline-3">
<h3 id="org181a423"><a id="org36b4586"></a> 1 Introduction</h3>
<div class="outline-text-3" id="text-org181a423">
<p>
The call for a dramatic reduction in software vulnerability is being heard from multiple sources, including the February 2016 Federal Cybersecurity Research and Development Strategic Plan <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. This plan starts by describing a well-known risk: current systems perform increasingly vital tasks and are widely known to possess vulnerabilities. These vulnerabilities are often not easy to discover and difficult to correct. Cybersecurity has not kept pace, and the pace that is needed is rapidly accelerating. The plan defines goals for the near, mid and long term. This report addresses the first mid-term goal:<br  />
</p>

<blockquote>
<p>
Achieve S&amp;T [Science and Technology] advances to reverse adversaries' asymmetrical advantages, through sustainably secure systems development and operation. &#x2026; This goal is two-pronged: first, the design and implementation of software, firmware, and hardware that are highly resistant to malicious cyber activities (e.g., software defects, which are common, give rise to many vulnerabilities) &#x2026;<br  />
</p>
</blockquote>

<p>
There are many different definitions of the term "vulnerability" covering various combinations of concepts, including knowledge, attacks, exploitability, risk, intention, threat, scope and time of introduction. For the purposes of this report, we define vulnerability as one or more weaknesses that can be accidentally triggered or intentionally exploited and result in a violation of desired system properties. A weakness is an undesired characteristic of a system's requirements, design or implementation <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. This definition excludes<br  />
</p>

<ul class="org-ul">
<li>manual configuration or operational mistakes, such as installing a program as world - readable or setting a trivial password for administrator access;<br  /></li>
<li>insider malfeasance, such as exfiltration by Edward Snowden;<br  /></li>
<li>functional bugs, such as the mixture of SI (International System of Units) and Imperial units, which led to the loss of the Mars Climate Orbiter in 1999 <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>;<br  /></li>
<li>purposely introduced malware or corrupting "mis-features" in regular code, such as allowing root access if the user name is "JoshuaCaleb" and<br  /></li>
<li>software weaknesses that cannot be exploited (by "outsiders") as a result of input filtering or other mitigations.<br  /></li>
</ul>

<p>
Great strides have been made in defining software vulnerabilities, cataloging them and understanding them. Additionally, great strides have been made in educating the software community about vulnerabilities, attendant patches and underlying weaknesses. This work, however, is insufficient. Significant vulnerabilities are found routinely, many vulnerabilities lie undiscovered for years and patches are often not applied. Clearly a different approach &#x2013; one that relies on improving software &#x2013; is needed.<br  />
</p>

<p>
Strengthening protection requires increasing assurance that the products people develop and deploy are highly resistant to malicious cyber activities, because they include very few vulnerabilities &#x2026; [<sup><a id="fnr.1.100" class="footref" href="#fn.1">1</a></sup>, p. 17]<br  />
</p>
</div>
