dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-orgf4abd09" class="outline-4">
<h4 id="orgf4abd09"><a id="orgfeb9048"></a> 1.1 Scope of Report</h4>
<div class="outline-text-4" id="text-orgf4abd09">
<p>
The goal of this report is to present a list of specific technical approaches that have the potential to make a dramatic difference reducing vulnerabilities - by stopping them before they occur, by finding them before they are exploited or by reducing their impact.<br  />
</p>

<ul class="org-ul">
<li>Stopping vulnerabilities before they occur generally includes improved methods for specifying, designing and building software.<br  /></li>
<li>Finding vulnerability includes better testing techniques and more efficient use of multiple testing methods.<br  /></li>
<li>Reducing the impact of vulnerabilities refers to techniques to build architectures that are more resilient, so that vulnerabilities cannot be exploited for significant damage.<br  /></li>
</ul>

<p>
The report does not segregate the approaches into these three bins, since some approaches may include pieces from multiple bins.<br  />
</p>

<p>
The list of approaches in this report is not comprehensive. It is intended to show how a wide variety of approaches can make a significant impact. New approaches will continue to be developed and brought to general use.<br  />
</p>

<p>
The list of approaches for reducing vulnerabilities focuses on approaches that meet three criteria:<br  />
</p>

<ol class="org-ol">
<li>Dramatic impact,<br  /></li>
<li>3 to 7-year time frame and<br  /></li>
<li>Technical activities.<br  /></li>
</ol>

<p>
Dramatic. This means approaches that are broadly applicable and that significantly contribute to the goal of reducing vulnerabilities by two orders of magnitude. In the case of typical software, estimates are up to 25 errors per 1000 lines of code [<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>, p. 521]. Nearly two-thirds of vulnerabilities come from simple programming errors <sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>. These approaches have been selected for the possibility of reinforcing the ambition of reaching 25 errors per 100 000 lines of code for those types of software and achieving corresponding reductions for other types. (Systems with near-zero errors are produced routinely today in the aerospace industry, but at several times the cost of ordinary software.) Determining whether an approach has a dramatic impact requires the ability to measure it. Measuring software quality is a difficult task. Parallel efforts on improving the measurement of software vulnerabilities are going on.<br  />
</p>

<p>
3- to 7-year time frame. This time frame was selected because it is far enough out to make dramatic changes, based on existing techniques that have not reached their full potential for impact. It is a time frame that it is reasonable to speculate about. Beyond this time frame, it is too difficult to predict what new technologies and techniques will be developed, potentially making their own set of dramatic changes on how information technology is used. In the near future, the emphasis will be on implementing techniques that are already being deployed, such as work in secure software development and testing. The dividing line between deployed and future techniques is not crisp. If a technique is widely used or used by major software developers, it was not included although broader adoption of the technique would be beneficial.<br  />
</p>

<p>
Technical. There are many different types of approaches to reducing software vulnerabilities, many of which are not primarily technical - from helping users meaningfully request security to funding research and operational activities and training all parties, who design, build, test and use software. During the development of this report, many ideas were put forward across this broad span. The report only addresses technical approaches in order to have a manageable scope, which builds on expertise available during the development of the report. These other areas are critical, too.<br  />
</p>

<p>
During the drafting of this report, many excellent ideas were brought forth that are outside the scope of this report and are summarized in Section 4. Examples of these activities include:<br  />
</p>

<ul class="org-ul">
<li>Improved funding,<br  /></li>
<li>Improving education,<br  /></li>
<li>More research for various aspects of software understanding,<br  /></li>
<li>Increased use of grand challenges and competitions,<br  /></li>
<li>Providing better methods for consumers of software to ask for and evaluate lower-vulnerability software,<br  /></li>
<li>Liability and standards and<br  /></li>
<li>Threat analysis.<br  /></li>
</ul>

<p>
This report excludes a discussion of vulnerabilities in hardware. This is not to say that these are not critical. These can be addressed in another report. This report targets a broad range of software, including government-contracted software, proprietary and open source software. It covers software for general use, mobile devices and embedding in appliances and devices. The goal is to prevent vulnerabilities in new code, in addition to identifying and fixing vulnerabilities in existing code.<br  />
</p>
</div>
</div>

<div id="outline-container-orga85c87c" class="outline-4">
<h4 id="orga85c87c"><a id="org57aff8b"></a> 1.2 Findings</h4>
<div class="outline-text-4" id="text-orga85c87c">
<p>
While the problem of reducing software vulnerabilities is a difficult one and clearly requires a mixture of technical, operational, managerial, psychological and cultural changes to address the problem, it is possible to make a dramatic difference. This report describes five mid-term approaches that have the potential to address technical aspects of the problem. The approaches included here are not a comprehensive list; they represent a wide range of potential approaches and highlight how reducing software vulnerabilities can be accomplished. All of these approaches will require improved research infrastructure, including significantly better metrics. As noted, they cannot be successful by themselves and will need to be integrated into the larger software developer and user communities. Furthermore, this report does not focus on current trends in secure software development that are already in significant use.<br  />
</p>
</div>
</div>

<div id="outline-container-org696acbe" class="outline-4">
<h4 id="org696acbe"><a id="org19ead1f"></a> 1.3 Audience</h4>
<div class="outline-text-4" id="text-org696acbe">
<p>
The primary audience for the report is the White House Office of Science and Technology Policy (OSTP). It is anticipated that other policy bodies, funders and researchers will find the report useful as they consider investments and programs to improve software quality. Since the report focuses on a three to seven-year time frame, it is not intended as a guide for software developers.<br  />
</p>
</div>
</div>

<div id="outline-container-org6717ef0" class="outline-4">
<h4 id="org6717ef0"><a id="orgf14e9ea"></a> 1.4 Measures</h4>
<div class="outline-text-4" id="text-org6717ef0">
<p>
There are multiple efforts to define software vulnerabilities, their prevalence, their detectability and the efficacy of detection and mitigation techniques. The ability to measure software can play an important role in dramatically reducing software vulnerabilities. Industry requires evidence of the extent of such vulnerabilities, in addition to knowledge in determining which techniques are most effective in developing software with far fewer vulnerabilities. With effective measures that can function as market signals, industry can favor and select low vulnerability software, thus encouraging development of better software <sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>. Additionally, and more critically, industry requires guidance in identifying the best places in code to deploy mitigations or other actions. This evidence comes from measuring, in the broadest sense, or assessing the properties of software.<br  />
</p>
</div>
</div>
