dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-org7e74fc1" class="outline-4">
<h4 id="org7e74fc1"><a id="orgafb54a1"></a> 1.5 Methodology</h4>
<div class="outline-text-4" id="text-org7e74fc1">
<p>
In order to produce the list of approaches, the Office of Science and Technology Policy (OSTP) asked NIST to lead a community-based effort. The report was developed during an eight-month period. Given the compressed time frame, the focus of the report was kept to the criteria described above to highlight promising approaches rather than perform a comprehensive analysis. NIST consulted with multiple experts in the software assurance community including:<br  />
</p>

<ul class="org-ul">
<li>Two OSTP-hosted inter-agency roundtables;<br  /></li>
<li>Half-day session at the Software and Supply Chain Assurance (SSCA) Summer Forum;<br  /></li>
<li>All-day workshop on Software Measures and Metrics to Reduce Security Vulnerabilities;<br  /></li>
<li>Two-day workshop on Reducing Software Defects and Vulnerabilities, hosted by the<br  /></li>
</ul>
<p>
Software Productivity, Sustainability, and Quality (SPSQ) Working Group of the Networking and Information Technology Research and Development (NITRD) Program and<br  />
</p>
<ul class="org-ul">
<li>Public comment from 4 to 18 October 2016.<br  /></li>
</ul>
</div>
</div>

<div id="outline-container-org53a5a70" class="outline-4">
<h4 id="org53a5a70"><a id="orgadbd181"></a> 1.6 Report Organization</h4>
<div class="outline-text-4" id="text-org53a5a70">
<p>
The report is organized into two major sections. The first, Section 2, enumerates technical approaches and the second, Section 3, addresses measures.<br  />
</p>

<p>
Section 2 has subsections for technical approaches to deal with vulnerabilities in software. These include formal methods, such as sound static program analyses, model checkers and Boolean Satisfiability (SAT) solvers. It also suggests having a directory of verified tools and verified code. This section addresses system level security, including operating system containers and microservices. Additive software analysis techniques are addressed. Finally, it discusses moving target defenses (MTD) and automatic software diversity. These include compile-time techniques, system or network techniques and operating system techniques.<br  />
</p>

<p>
Each subsection follows the same format:<br  />
</p>

<ul class="org-ul">
<li>Definition and Background: Definition of the area and background;<br  /></li>
<li>Maturity Level: How mature the area is, including a discussion of whether the approach has been used in the "real world" or just in a laboratory and issues related to scalability and usability;<br  /></li>
<li>Basis for Confidence: Rationale for why this could work;<br  /></li>
<li>Rationale for Potential Impact and<br  /></li>
<li>Further Reading, including papers and other materials.<br  /></li>
</ul>

<p>
Section 3 covers software measures. It is designed to encourage the adoption of measurement and tools to address vulnerabilities in software. It addresses product measures and how to develop better code. It also addresses the criticality of software security and quality measures.<br  />
</p>

<p>
After those two major sections are Section 4, on crosscutting issues, such as engaging the research community, education and vehicles to transition the technical approaches to general use, and references in Section 5.<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-org25be9c6" class="outline-3">
<h3 id="org25be9c6"><a id="orgc4f51e0"></a> 2 Technical Approaches</h3>
<div class="outline-text-3" id="text-org25be9c6">
<p>
There are many approaches at varying levels of maturity that show great promise for reducing the number of vulnerabilities in software. This report highlights five of them that are sufficiently mature and have shown success, so that it is possible to extrapolate into a three to seven-year horizon. This list is not meant to be exhaustive, but rather to show that it is possible to make significant progress in reducing vulnerabilities and to lay out paths to achieve this ambitious goal. One of the significant themes of the SPSQ workshop was the need to improve not just software, but also testing tools by applying formal techniques.<br  />
</p>
</div>
