dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-org3199ba9" class="outline-4">
<h4 id="org3199ba9"><a id="org58bcb31"></a> 2.1 Formal Methods</h4>
<div class="outline-text-4" id="text-org3199ba9">
<p>
Formal methods include all software analysis approaches based on mathematics and logic, including parsing, type checking, correctness proofs, model-based development and correct-by-construction. Formal methods can help software developers achieve greater assurance that entire classes of vulnerabilities are absent and can also help reduce unpredictable cycles of expensive testing and bug fixing.<br  />
</p>

<p>
In the early days of programming, some practitioners proved the correctness of their programs. That is, given language semantics, they logically proved that their program had certain properties or gave certain results. As the use of software exploded and programs grew so large that purely manual proofs were infeasible, formal correctness arguments lost favor. In recent decades, developments, such as the breathtaking increase in processing capacity predicted by Moore's law, multi-core processors and cloud computing, made orders of magnitude more computing power readily available. Advances in algorithms for solving Boolean Satisfiability (SAT) problems, satisfiability modulo theories (SMT) <sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup>, decision procedures (e.g., ordered binary decision diagrams - OBDD) and reasoning models (e.g., abstract interpretation and separation logic) dramatically slashed resources required to answer questions about software.<br  />
</p>

<p>
One early effort at using formal methods to achieve far fewer vulnerabilities was the 1980s' DoD Trusted Computer Security Evaluation Criteria (TCSEC). The TCSEC specified multiple levels of software assurance. The highest level, A1, required formal specification of the system and mathematical proof of correspondence between the code and the specification. Successful theorem proving tools were developed and several formally-proved systems were produced, but the expense and time required was prohibitive-as much as two years-for practical use.<br  />
</p>

<p>
By the 1990s, formal methods had developed a reputation as taking far too long, in machine time, person years and project time, and requiring a PhD in computer science and mathematics to use them. This is no longer the case. Formal methods are widely used today. For instance, compilers use SAT solvers to allocate registers and optimize code. Operating systems use algorithms formally guaranteed to avoid deadlock. Kiniry and Zimmerman call these "Secret Ninja Formal Methods" <sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>: they are invisible to the user, except to report that something is not right. In contrast to such "invisible" use of formal methods, overt use often requires recasting problems into a form compatible with formal methods tools.<br  />
</p>

<p>
Overt formal methods are recommended in automotive <sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup> and railway <sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup> standards. Formal proof techniques have significantly reduced the effort to achieve objectives defined by the airborne standard, DO 178B <sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup>. Its successor, DO 178C, has an entire supplement, DO 333, devoted to the use of formal methods for software verification.<br  />
</p>

<p>
Most proposed cryptographic protocols are now examined with model checkers for possible exploits, and analysts can perform mostly-automated proofs that implementations of cryptographic algorithms match specifications <sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup>. Practitioners also use model checkers to look for attack paths in networks.<br  />
</p>

<p>
Despite their strengths, formal methods are less effective if there is no clear statement of software requirements or if what constitutes proper software behavior can only be determined by human judgment or through balancing many conflicting factors. Thus, we would not expect formal methods to contribute as much to the evaluation of the usability of a user interface, development of exploratory software or unstructured problems.<br  />
</p>

<p>
Formal methods include many, many techniques at all stages of software development and in many different application areas. We do not list every potentially helpful formal method. Instead, we concentrate on a few methods that may contribute significantly in the mid-term.<br  />
</p>
</div>

<ul class="org-ul"><li><a id="org661e42a"></a><a id="org7243970"></a> 2.1.1 Sound Static Program Analysis<br  /><div class="outline-text-5" id="text-org661e42a">
<p>
Static analysis is the examination of software for specific properties without executing it. For our purposes, we only consider automated analysis. Heuristic analysis is faster than sound analysis, but lacks assurance that comes from a chain of logical reasoning. Some questions can only be answered by running the software under analysis, i.e., through dynamic analysis. Combining static and dynamic analysis yields a hybrid technique. In particular, executions may produce existence proofs of properties that cannot be confirmed using static techniques only.<br  />
</p>

<p>
Many representations of software (e.g., requirements, architecture, source code and executables) may be statically analyzed. Source code analysis, however, is the most mature. One advantage of source code analysis is that the context of problems identified in source code can be communicated to software developers using a familiar representation: the code itself. When other representations are analyzed, an additional step is required to render a warning into a form that people can first understand and then relate to a program under analysis.<br  />
</p>

<p>
According to Doyle's assessment, sound static analysis is superior to current software development practices in terms of coverage, scalability and benefit for the effort <sup><a id="fnr.13" class="footref" href="#fn.13">13</a></sup>. We believe that one limitation is that it is difficult to specify some properties in available terms.<br  />
</p>

<p>
Formal specification and sound static analysis have shown significant applicability in recent years. For example, the Tokeneer project shows that software can be developed with formal methods faster and cheaper and with fewer bugs than with traditional software development techniques [<sup><a id="fnr.14" class="footref" href="#fn.14">14</a></sup>, <sup><a id="fnr.15" class="footref" href="#fn.15">15</a></sup>]. TrustInSoft used Frama-C to prove the absence of a set of Common Weakness Enumeration (CWE) classes in PolarSSL, now known as mbed TLS [<sup><a id="fnr.16" class="footref" href="#fn.16">16</a></sup>, <sup><a id="fnr.17" class="footref" href="#fn.17">17</a></sup>]. Ourghanlian compares the use of PolySpace Verifier, Frama-C and Astrée to assess safety-critical software in nuclear power plants <sup><a id="fnr.18" class="footref" href="#fn.18">18</a></sup>. Sound static analysis and other formal methods are extensively employed for software development in areas beyond transportation, aerospace and nuclear plant control <sup><a id="fnr.19" class="footref" href="#fn.19">19</a></sup>.<br  />
</p>

<p>
These developments illustrate a few of the many uses of static analysis. Going forward, static analysis has the potential to efficiently preclude several classes of errors in newly-developed software and to reduce the uncertainty regarding resources needed to reach higher levels of assurance through testing.<br  />
</p>
</div></li>
