dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<li><a id="org0932b2e"></a><a id="orgeda36c2"></a> 2.1.2 Model Checkers, SAT Solvers and Other "Light Weight" Decision Algorithms<br  /><div class="outline-text-5" id="text-org0932b2e">
<p>
These algorithms can answer questions about desirable higher level properties, such as that a protocol only allows sensitive text to be read if one has a key, that security properties are preserved by the system, that an assignment of values satisfies multiple constraints or that there are no paths to breaches via (known) attacks. These algorithms can also be applied to analyze detailed design artifacts, such as finite (and infinite) state machines.<br  />
</p>

<p>
Doyle's assessment is that model checkers can have excellent coverage and many properties can be represented <sup><a id="fnr.13.100" class="footref" href="#fn.13">13</a></sup>. However, since the effort required increases exponentially with problem size, there is always an effectize size limit. Problems smaller than the limit can be solved quickly. Very large problems may require excessive resources or intensive human work to break the problem into reasonable pieces.<br  />
</p>

<p>
Such techniques can be applied in essentially two ways. First, they can be used as part of software in production. For instance, instead of an ad hoc routine to find an efficient route for a delivery truck, an application can use a well-studied Traveling Salesman or spanning tree algorithm. Second, and perhaps more pertinent to the theme of this report, is to use the algorithms to design or verify software.<br  />
</p>
</div></li>

<li><a id="org384f792"></a><a id="orgafb2dcf"></a> 2.1.3 Assertions, Pre- and Postconditions, Invariants, Aspects and Contracts<br  /><div class="outline-text-5" id="text-org384f792">
<p>
Programmers generally have a body of information that gives them confidence that software will perform as expected. A neglected part of formal methods is to unambiguously record such insights. Variants go by different terms, such as contracts, assertions, preconditions, annotations, postconditions and invariants. It may cost programmers some extra thought to state exactly what is going on using a language similar to code expressions, but such statements help. Automated aids, such as Counterexample-Guided Abstraction Refinement (CEGAR), can help produce statements. These statements are activated ("compiled in") during development and testing, then may be deactivated before release.<br  />
</p>

<p>
The benefit is that these formal statements of properties carried in the code may be used to cross- check the code. For example, tests may be generated directly from assertions. They may be activated to perform internal consistency checks during testing or production. Faults can therefore be detected much earlier and closer to erroneous code, instead of having to trace back from externally visible system failures. Assertion-based testing can detect up to 90 % of errors with an appropriate level of coverage of the input space <sup><a id="fnr.20" class="footref" href="#fn.20">20</a></sup>. Such statements also supply additional information to perform semi-automated proofs of program correctness. Unlike comments, which may not be updated when the code changes, these can be substantiated or enforced by a computer and, therefore, must continue to be accurate statements of program features and attributes.<br  />
</p>

<p>
A striking example of how such formal statements could help is the 1996 failure of the first Ariane 5 rocket launched. The Ariane 5 used software from the successful Ariane 4. When the Ariane 4 was designed, analysis showed that a 16-bit integer could handle its speeds. However, higher Ariane 5 speed values overflowed the variable, leading to computer shut down and the loss of the vehicle. If the code had a precondition that the speed must fit in a 16-bit integer, "Any team worth its salt would have checked &#x2026; [preconditions, which] would have immediately revealed that the Ariane 5 calling software did not meet the expectation of the Ariane 4 routines that it called." <sup><a id="fnr.21" class="footref" href="#fn.21">21</a></sup><br  />
</p>
</div></li>

<li><a id="org6cfb965"></a><a id="orgee536ba"></a> 2.1.4 Correct-by-Construction and Model-Based Development<br  /><div class="outline-text-5" id="text-org6cfb965">
<p>
In model-based development, a software developer creates and modifies a model of a system. Behavior may be specified in a higher-level or domain-specific language or model, and then code is automatically generated. Much or all of the code is generated from the model. This is one correct-by-construction technique. This technique and others, such as design by refinement, aim to avoid whole classes of vulnerabilities entirely, since the developer rarely touches the code. Code synthesis like this is useful in fewer situations than other formal methods, since it may be impractical to develop the modeling superstructure and code generator for an area, e.g., a user interface with error recovery and help prompts. Such models or specifications may also generate test suites or oracles. They may also be used to validate or monitor system operation.<br  />
</p>

<p>
When analysts can specify complete high-level models for entire systems, or even subsystems, we call the model a "domain-specific language" (DSL) and cease to consider it noteworthy. This represents a substantial use of formal methods. According to Doyle's assessment, program synthesis has an "A+" in coverage and "B" in effort and properties <sup><a id="fnr.13.100" class="footref" href="#fn.13">13</a></sup>.<br  />
</p>
</div></li>

<li><a id="orgf1b0268"></a><a id="org97a8afe"></a> 2.1.5 Directory of Verified Tools and Verified Code<br  /><div class="outline-text-5" id="text-orgf1b0268">
<p>
Software developers often must expend significant effort to qualify tools or develop program libraries with proven properties. Even when a later developer wishes to use the results of such work, there are no central clearing houses to consult. A list of verified tools, carefully constructed libraries and even reusable specifications and requirements can speed the adoption of formal methods. Such a tool library could facilitate wider use, with accompanying assurance, of software with dramatically reduced numbers of vulnerabilities.<br  />
</p>

<p>
Many companies and government agencies evaluate the same tools or the same software for similar uses. Since it may be difficult to find out who may have done related evaluations, each entity must duplicate the work, sometimes with less knowledge and care than another has already applied. It is especially challenging since many contracts discourage sharing results <sup><a id="fnr.22" class="footref" href="#fn.22">22</a></sup>. A repository or list would be of great benefit. Knowing about related efforts, developers could contribute to one effort, instead of working on their own. As a code or "live" instantiation of a repository, the Open Web Application Security Project (OWASP) foundation coordinated a project to develop a shared application program interface (API) that encapsulated key security operation, called Enterprise Security API (ESAPI).<br  />
</p>

<p>
See Sect. <a href="#org62489fb">2.4</a> for a discussion of re-use of well-tested and well-analyzed code.<br  />
</p>
</div></li>
