dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<li><a id="orgfc66ba6"></a><a id="org77ffcb6"></a> 2.1.6 Cyber Retrofitting: Putting Formal Methods to Work<br  /><div class="outline-text-5" id="text-orgfc66ba6">
<p>
The preceding techniques can be put to use to develop new software, however reworking all legacy software is impractical. This is called "cyber retrofitting" in analogy to seismic retrofitting for greater earthquake resistance <sup><a id="fnr.23" class="footref" href="#fn.23">23</a></sup>. The first step is to identify the most critical, key or foundational components in existing systems. SPSQ workshop participants also emphasized the use of formal methods for key modules rather than entire applications. A key component may be a compiler or run-time library, in addition to purpose-written code. These components are then closely examined or reengineered with the appropriate formal methods to gain higher levels of assurance, as was done for PolarSSL, now known as mbed TLS, [<sup><a id="fnr.16.100" class="footref" href="#fn.16">16</a></sup>, <sup><a id="fnr.17.100" class="footref" href="#fn.17">17</a></sup>] in the wake of Heartbleed or the CompCert Verifying C Compiler <sup><a id="fnr.24" class="footref" href="#fn.24">24</a></sup>.<br  />
</p>

<p>
Another small step in cyber retrofitting is to recompile components with automatic strengthening or hardening. For instance, a compiler can add bounds checks where possible on all questionable memory accesses to greatly reduce the number of unrecognized buffer overflows (BOF class) <sup><a id="fnr.25" class="footref" href="#fn.25">25</a></sup>. Such strengthening typically has little performance impact <sup><a id="fnr.26" class="footref" href="#fn.26">26</a></sup>. Compilers also can replace typical unsafe functions with safer "fortified" functions and can employ executable space protection, i.e., mark memory regions for data as non-executable.<br  />
</p>
</div></li>

<li><a id="org07a923e"></a><a id="org3490b08"></a> 2.1.7 Maturity Level<br  /><div class="outline-text-5" id="text-org07a923e">
<p>
Today formal methods are used, often relatively invisibly, throughout the world. One of the most pervasive applications is the use of strong type checking, which is a formal method, within modern programming languages. Other, admittedly limited, uses are the algorithms of various software checking tools, some of them built into widely used development environments (e.g., that tag inconsistent use of variables, missing values or use of unsafe interfaces). In 2010, researchers at National ICT (Information Communications Technology) Australia (NICTA) demonstrated the formal verification of the seL4 microkernel comprising about 10 000 lines of C code <sup><a id="fnr.27" class="footref" href="#fn.27">27</a></sup>. The UK National Air Traffic Service (NATS) interim Future Area Controls Tools Support (iFACTS) has over 200 000 lines of SPARK source code, and "all code changes must prove OK before code can be committed" <sup><a id="fnr.28" class="footref" href="#fn.28">28</a></sup>.<br  />
</p>
</div></li>

<li><a id="org3c59512"></a><a id="org150c64f"></a> 2.1.8 Basis for Confidence<br  /><div class="outline-text-5" id="text-org3c59512">
<p>
Assertions, contracts, invariants and other formal declarations have been significantly adopted in high-quality software. Their gradual improvement to encompass more advanced conditions and API checking is because they have already proven themselves in developer communities. For instance, Source code Annotation Language (SAL 2.0) is available in Visual Studio 2015. Many tools now perform static analysis. A natural progression is to promote more and more advanced forms of static and hybrid analysis. Software proving based on techniques such as pre- and post- condition satisfaction and proof-carrying code have seen initial adoption in critical software <sup><a id="fnr.29" class="footref" href="#fn.29">29</a></sup>. They require more effort and cost, however, in some cases they have been shown to be cost effective in the long run: improvement in development time and cost in one-third of uses and fewer or no fixes to deployed systems <sup><a id="fnr.30" class="footref" href="#fn.30">30</a></sup>.<br  />
</p>
</div></li>

<li><a id="org4b64e8e"></a><a id="org6188fa7"></a> 2.1.9 Rationale for Potential Impact<br  /><div class="outline-text-5" id="text-org4b64e8e">
<p>
The greatest potential impact is likely in costs avoided for components that, over time, become heavily relied upon. The Heartbleed debacle is an example of a modest code base with outsized importance: a judicious use of formal methods might have avoided the problem in the first place. Generally, higher quality software, such as can be produced using formal methods, can be used to lower long-term maintenance and replacement costs of software components. Unlike physical systems that wear out and eventually fail, software systems suffer failures when they are incorrect and the flaws are triggered by environmental factors, such as, particular sequences or combinations of inputs <sup><a id="fnr.31" class="footref" href="#fn.31">31</a></sup>.<br  />
</p>
</div></li>

<li><a id="org1a16d1e"></a><a id="org370b0e8"></a> 2.1.10 Further Reading<br  /><div class="outline-text-5" id="text-org1a16d1e">
</div></li></ul>
</div>
