dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<li><a id="orgae49895"></a><a id="org2097557"></a> 2.2.2 Microservices<br  /><div class="outline-text-5" id="text-orgae49895">
<p>
Microservices describe "An approach to designing software as a suite of small services, each running in its own process and communicating with lightweight mechanisms." <sup><a id="fnr.42" class="footref" href="#fn.42">42</a></sup> The essential microservices idea is not new: it has been explored using web services and in operating systems based on microkernels such as the Mach microkernel <sup><a id="fnr.43" class="footref" href="#fn.43">43</a></sup>, the GNU Hurd <sup><a id="fnr.44" class="footref" href="#fn.44">44</a></sup> and the Web Services Architecture <sup><a id="fnr.45" class="footref" href="#fn.45">45</a></sup>. The microservices approach, however, structures services according to different criteria. Microservices should implement individual business (or mission) capabilities, have independent refresh cycles, be relatively easy to replace and be programming-language agnostic<sup><a id="fnr.42.100" class="footref" href="#fn.42">42</a></sup>. In short, each microservice should make economic and management sense on its own. At the same time, microservices may rely on one another, which can support well-defined modularity.<br  />
</p>

<p>
This approach to system structure can result in a number of components whose interfaces are explicitly defined and whose dependencies are similarly explicitly defined.<br  />
</p>

<p>
As a system operates and the flow of control passes between microservices, there is a natural incentive to "batch up" inter-service communications to amortize boundary-crossing overheads.<br  />
</p>

<p>
While this batching can increase latencies in some cases, it can also simplify inter-component dependencies and possibly reduce the likelihood of software flaws and, hence, vulnerabilities.<br  />
</p>

<p>
The deployment of software as collections of microservices raises a fundamental question: does it make sense to build a "trusted microservice"? Even more ambitiously, would it be feasible to develop microservices that are themselves reference monitors? The reference monitor concept dates from the 1972 Anderson Report <sup><a id="fnr.46" class="footref" href="#fn.46">46</a></sup> and refers to a system component that mediates all accesses to resources that it provides. A reference monitor is: 1) always invoked, 2) tamperproof and 3) verified (i.e., small enough to be built with high assurance). As microservices are becoming increasingly popular, the time may be right to research criteria for formulating microservices that are trustworthy, or that are reference monitors, and to understand the security limitations of the microservices' architectural patterns.<br  />
</p>

<p>
By making component dependencies and interactions more explicit, microservices appear to offer a new opportunity for interposition-based security enhancements. Wrapping layers inserted between microservice interactions would have the power to augment, transform, deny and monitor those interactions. Those powers could be used to restrict potential damage from software vulnerabilities, but interposition can also destabilize systems and impose slowdowns. A possible research thrust is to investigate interposition strategies that are compatible with microservice based systems. Microservices encourage a simplified interface between components (e.g., no memory sharing via global state). This simplification may enable microservice-based interposition to be performed with fewer associated effects on stability.<br  />
</p>
</div></li>

<li><a id="org86c3ebd"></a><a id="orgef2fdd2"></a> 2.2.3 Maturity Level<br  /><div class="outline-text-5" id="text-org86c3ebd">
<p>
Virtualization systems date from the 1960s. The LXC container form of virtualization began in 2008 and has been under active development since. A number of alternate lightweight virtualization systems exist, for example BSD Jails, OpenVZ and Oracle Solaris Zones. Containers are substantially deployed in clouds and on servers. <sup><a id="fnr.47" class="footref" href="#fn.47">47</a></sup><br  />
</p>

<p>
The current microservices terminology and design goals emerged by 2014. Earlier formulations, such as tasks running on microkernels, predate the CMU Mach project's initiation in 1985. Since then, microkernel technology has been a subject of ongoing research and has been integrated into significant commercial products, notably Apple's OS X.<br  />
</p>
</div></li>

<li><a id="orga101129"></a><a id="orgd5e8b58"></a> 2.2.4 Basis for Confidence<br  /><div class="outline-text-5" id="text-orga101129">
<p>
The base technologies are widely used, and there is a recognized need for more automation in the configuration of containers. So there could be demand pull. Because containers can be very quickly created, tested and deleted, there is a good case that extensive testing could be done on container configurations in a semi-automated manner. With respect to microservices, growing number of microservice frameworks indicates that the technology is increasing in popularity and that there is still room for enriching microservice frameworks and for having these enrichments adopted. Also, the modular nature of microservices may offer a pathway for deploying more secure versions of microservices without significantly disrupting service to clients.<br  />
</p>
</div></li>

<li><a id="orgb4db49b"></a><a id="org4dd25ed"></a> 2.2.5 Rationale for Potential Impact<br  /><div class="outline-text-5" id="text-orgb4db49b">
<p>
Operating system containers and microservices are already a significant part of the national information infrastructure. Given the clear manageability, cost and performance advantages of using them, it is reasonable to expect their use to continue to expand. Security-enhanced versions of these technologies, if adopted, can therefore have a widespread effect on the exploitation of software vulnerabilities.<br  />
</p>
</div></li>

<li><a id="org93fe6cc"></a><a id="orgcbe4b4b"></a> 2.2.6 Further Reading<br  /><div class="outline-text-5" id="text-org93fe6cc">
</div></li></ul>
</div>
