dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-org6aefe7e" class="outline-4">
<h4 id="org6aefe7e"><a id="org88e5ece"></a> 2.3 Additive Software Analysis Techniques</h4>
<div class="outline-text-4" id="text-org6aefe7e">
<p>
Currently there are many different tools and techniques, both as open source and as proprietary software, to analyze software and to check for myriad problems. Many of them can be executed through a general Integrated Development Environment (IDE), such as Eclipse. But current tools face a number of impediments. IDEs sometimes do not offer an "information bus" for tools to share software properties. Each tool must do its own parsing, build its own abstract syntax tree (AST), list variables with their scopes and attributes and "decorate" an AST with proven facts or invariants. Some tools are built on a common infrastructure, such as LLVM or ROSE <sup><a id="fnr.49" class="footref" href="#fn.49">49</a></sup>, so they share code, but they must still do much of the analysis over again. In addition, there are few standards that allow, for example, one parser to be swapped out for a new parser that runs faster.<br  />
</p>

<p>
Additive software analysis refers to a comprehensive approach for addressing impediments to the use of multiple advanced software checking tools. The goal of additive software analysis is to foster a continuing accumulation of highly-usable analysis modules that add together over time to continually improve the state of the practice in deployed software analysis. Additive Software Analysis has three parts. First, it is documentary standards to allow algorithms and tools to exchange information about software. Second, it is a framework or architecture to enable modular and distributed development of software assurance and assessment tools. This framework has a function similar to the Knowledge Discovery Metamodel (KDM) <sup><a id="fnr.50" class="footref" href="#fn.50">50</a></sup> or what is termed a black board in Artificial Intelligence (AI). Third, it is conceptual approaches to aggregate, correlate or synthesize the results and capabilities of tools and algorithms. A key output of additive software analysis will be a new generation of user-facing tools to readily combine the outputs from different tools and techniques into unified, more comprehensive assessments of a piece of software.<br  />
</p>

<p>
A comprehensive additive software analysis capability must facilitate tools working together, provide building blocks to jumpstart new tool development and facilitate integration and interoperability among tools. Hence, it must include standards, a framework and techniques to combine analysis results.<br  />
</p>
</div>

<ul class="org-ul"><li><a id="org086c3df"></a><a id="org2141eff"></a> 2.3.1 Software Information Expression and Exchange Standards<br  /><div class="outline-text-5" id="text-org086c3df">
<p>
Software assurance tools derive and store an enormous variety of information about programs. Unfortunately, there is no widely-accepted standard for exact definitions of the information or how it might be stored. Because of the lack of standards, developers must perform heroic feats to exchange information with fidelity between different analysis tools and algorithms.<br  />
</p>

<p>
Merely passing bits back and forth between tools is of little benefit unless those bits convey information that is understood the same way by tools. For example, "error," "fault," "failure," "weakness," "bug" and "vulnerability" are related, but different, concepts. Without standards, if one tool reports a bug, another tool may understand "bug" to indicate a higher (or lower!) potential for successful attack than the first tool's assessment.<br  />
</p>

<p>
For example, a variety of formally defined information may be relevant for analyzing a program:<br  />
</p>

<ul class="org-ul">
<li>Location in code;<br  /></li>
<li>The variables that are visible at a certain location, with the variable types;<br  /></li>
<li>Possible values of variables at a certain location. This may include relations between the values of variables, such as x &lt; y;<br  /></li>
<li>Call traces and paths, that is, all possible ways to reach this point;<br  /></li>
<li>Attribution to source code locations for chunks of binaries and executables;<br  /></li>
<li>Possible weaknesses, e.g., possible BOF <sup><a id="fnr.25.100" class="footref" href="#fn.25">25</a></sup>, or the input that will be used in an SQL query not filtered and therefore tainted;<br  /></li>
<li>Assertions, weakest preconditions, aspects, invariants and so forth and<br  /></li>
<li>Function signatures, including parameter types.<br  /></li>
</ul>

<p>
Program analysis can be applied at various stages of software development and to representations of a program at different levels of abstraction. For instance, tools may operate on the static structure of a program, such as its AST, on representations that represent data or control flow and even on semantic representations that encode functional behaviors, such as weakest preconditions. We look at each of these categories in turn below.<br  />
</p>

<p>
Abstract Representation Early static checkers usually had to include their own parsers for building an AST to analyze. However, compiler writers realized the importance of developing common intermediate representations (IRs) that are well-documented and easily accessible. For instance, in version 4.0, the development team of the GNU compiler, gcc, <sup><a id="fnr.51" class="footref" href="#fn.51">51</a></sup> introduced the intermediate language GENERIC, which is a language-independent format for representing source programs in any of several languages. As another example, the Clang compiler <sup><a id="fnr.52" class="footref" href="#fn.52">52</a></sup> provides a well-documented AST that may be either directly accessed by third-party plugins or saved in a common format, such as JSON, to be processed by third-party analysis tools. Other compilers that provide well-documented interchange formats include Frama-C <sup><a id="fnr.53" class="footref" href="#fn.53">53</a></sup> and the ROSE compiler infrastructure <sup><a id="fnr.49.100" class="footref" href="#fn.49">49</a></sup>.<br  />
</p>

<p>
Intermediate Representation Tools may perform in-depth analyses on intermediate representations (IRs) that are closer to the final executable code generated by compilers. For instance, the GNU compiler defines the GIMPLE format in which the original source program is broken down into a simple three-address language. Similarly, the Clang compiler provides the LLVM bitcode representation, a kind of typed assembly language format that is not tied to a specific processor. Others are Common Intermediate Language (CIL) <sup><a id="fnr.54" class="footref" href="#fn.54">54</a></sup> and the Java Virtual Machine Instruction Set or bytecode <sup><a id="fnr.55" class="footref" href="#fn.55">55</a></sup>. The Vine Intermediate Language is a platform-independent machine language <sup><a id="fnr.56" class="footref" href="#fn.56">56</a></sup>.<br  />
</p>

<p>
Semantic Representations Tools that check functional correctness properties typically need a representation that is more suited to expressing logical program properties than the representations discussed above. While such representations are not as mature as ASTs and compiler IRs, a few have gained popularity in recent years. For instance, the intermediate verification language Boogie <sup><a id="fnr.57" class="footref" href="#fn.57">57</a></sup>, which provides features such as parametric polymorphism, universal and existential quantification, nondeterministic choice and partial orderings, has become a popular backend for sophisticated checkers of both low-level languages, such as C and C++, and higher-level object-oriented languages, such as Eiffel and C#. Boogie programs can be translated into the SMT-LIB format <sup><a id="fnr.58" class="footref" href="#fn.58">58</a></sup>, which allows them to be checked with any theorem prover that accepts the SMT-LIB format. Another example of a common language for semantic representations is Datalog <sup><a id="fnr.59" class="footref" href="#fn.59">59</a></sup>, which has been used to build a variety of tools for checking array bound overflows, finding race conditions in multithreaded programs and checking web application security.<br  />
</p>
</div></li>
