dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<li><a id="orgbc3b7c4"></a><a id="orgb0b96bd"></a> 2.3.2 Tool Development Framework or Architecture<br  /><div class="outline-text-5" id="text-orgbc3b7c4">
<p>
To foster new tool development, additive software analysis requires initial building blocks. The key initial building block is a framework that can tie the capabilities of tools or techniques together. Just as Eclipse greatly facilitates the improvement of IDE technology for developing code, a framework for additive software analysis will aim to enable synergistic development of software assurance and testing tools. This "framework" may be a separate tool, or it may be a plugin or update to an existing IDE.<br  />
</p>

<p>
Broadly speaking, there are two common methods for frameworks to transmit information between program analysis tools. The first method integrates a checker as a plugin into an existing compiler toolchain. Modern compiler frameworks, e.g., gcc, Clang and Frama-C, make it easy to write new plugins. Furthermore, plugins are often allowed to update an AST or intermediate form, thus allowing plugins to make the results of their analysis available for use by other plugins. For instance, the Frama-C compiler framework provides a library of plugins that includes use-def and pointer-alias analyses that are often necessary for writing semantic analyzers. The second method relies on a common format that is written to disk or sent via network to pass information. An example of this is the Evidential Tool Bus <sup><a id="fnr.60" class="footref" href="#fn.60">60</a></sup> that allows multiple analysis engines produced by different vendors to exchange logical conclusions in order to perform sophisticated program analyses. Information could be attached to the code to become "assurance-carrying code" <sup><a id="fnr.61" class="footref" href="#fn.61">61</a></sup>. An additive framework would support both information transmission approaches in order to reuse existing efforts as much as possible.<br  />
</p>

<p>
The framework capabilities referred to in this section focus on information exchange among tools, rather than development capabilities of frameworks discussed in Sect. <a href="#org62489fb">2.4</a>.<br  />
</p>
</div></li>

<li><a id="org116e181"></a><a id="org440e4b8"></a> 2.3.3 Strategy to Combine Analysis Results<br  /><div class="outline-text-5" id="text-org116e181">
<p>
With standards in place and a framework, we can get increased benefit by adding together or combining different software analyses. There are three general ways that results of software analysis can be added together. The first case is simply more information. Suppose the programmer already has a tool to check for injection bugs (INJ class) <sup><a id="fnr.25.100" class="footref" href="#fn.25">25</a></sup>. Adding a tool to check for deadlocks could give the programmer more information.<br  />
</p>

<p>
The second case is confirmatory or contradictory. The programmer may have two different heuristics to find faulty operation (FOP class) bugs <sup><a id="fnr.25.100" class="footref" href="#fn.25">25</a></sup> that have independent chances of reporting true FOP bugs and false positives. The framework could be used to correlate the outputs of the two heuristics to produce a single result with fewer false positives. In contrast, one tool may say that a statement is reachable, while another tool says that it is not. This contradiction may indicate differences in assumptions or an error in a tool. A set of deduction rules used in one tool may be consistent in isolation, but inconsistent with rules from another tool.<br  />
</p>

<p>
The third case of additive software analysis is synergy. A research group with expertise in formal reasoning about memory use and data structures could build upon a component developed by a group that specializes in "parsing" binary code, thus creating a tool that reasons about the memory use of binaries. Developers can experiment with hybrid and concolic assurance tools more quickly. For instance, a tool may use a static analyzer to get the code locations that may have problems then, using constraint satisfiers and symbolic execution, create inputs that trigger a failure at each location.<br  />
</p>
</div></li>

<li><a id="org626f8b8"></a><a id="org0fb7399"></a> 2.3.4 Technology to Combine Analysis Results<br  /><div class="outline-text-5" id="text-org626f8b8">
<p>
Once trained, such neural networks might serve as vulnerability detection engines in their own right. Incorrect conclusions from manual analysis is both time- and resource-intensive. To be effective, the above strategies to combine results must be instantiated in tools with appropriate technology. For instance, Code Dx <sup><a id="fnr.62" class="footref" href="#fn.62">62</a></sup> is a tool that matches, consolidates and presents the output of analysis tools. Even more powerful would be applying machine learning techniques, such as those in Microsoft's Cognitive Services and Computational Network Toolkit and Google's TensorFlow.<br  />
</p>

<p>
The underlying hardware required to perform both the training and inference stages of deep learning and neural networks has dramatically dropped in price. Cloud services now provide high-end graphics processor unit (GPU) instances on demand. This computing capability dramatically increases the speed of machine learning algorithms, allowing for training with much larger datasets and significantly faster training and feedback loops. Organizations that have amassed large corpora of vulnerability, exploit, malware, rootkit and backdoor information can mine this information with well-known data science techniques to derive new insights and value.<br  />
</p>

<p>
Once trained, such neural networks might serve as vulnerability detection engines in their own right. Incorrect conclusions from human practitioners can be fed back into the training phase to automatically strengthen the discrimination of the algorithms or networks and incrementally improve them. These techniques have the potential to detect vulnerabilities across a broad set of languages, including newly launched languages without well-established analysis tools, and even detect new classes of vulnerabilities.<br  />
</p>

<p>
This detection capability could augment existing tool chains. More importantly, results from other analysis tools could be an additional source of information for training and analysis of these powerful techniques. These same networks, given enough resources, can also analyze vast swaths of source code with the same goal of identifying and prioritizing risky components.<br  />
</p>
</div></li>

<li><a id="orgb24b42b"></a><a id="org98be9be"></a> 2.3.5 Maturity Level<br  /><div class="outline-text-5" id="text-orgb24b42b">
<p>
Many commonly used compilers, such as gcc, Clang and Frama-C, provide built-in support for adding plugins that process and update AST and IR representations. Additionally, large communities have developed extensive libraries of plugins and created wiki sites with tutorials and reference manuals that lower the bar for new users to become involved. In the case of semantic representations, the communities are smaller and the bar to entry is higher, although languages like Boogie have been successfully used as the engine by several research groups for building checkers for diverse languages, such as C <sup><a id="fnr.63" class="footref" href="#fn.63">63</a></sup> and Eiffel <sup><a id="fnr.64" class="footref" href="#fn.64">64</a></sup>, and even an operating system <sup><a id="fnr.65" class="footref" href="#fn.65">65</a></sup>.<br  />
</p>

<p>
There are many current software information exchange systems, such as LLVM, ROSE, gcc's GENERIC or GIMPLE and the Knowledge Discovery Metamodel (KDM). Formats to consolidate the output of tools, such as Tool Output Integration Framework (TOIF) and Software Assurance Findings Expression Schema (SAFES) <sup><a id="fnr.66" class="footref" href="#fn.66">66</a></sup>, already implicitly indicate classes of useful knowledge about software.<br  />
</p>
</div></li>
