dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<li><a id="org7124501"></a><a id="orgadcd38e"></a> 2.3.6 Basis for Confidence<br  /><div class="outline-text-5" id="text-org7124501">
<p>
The leading static analysis tools today have low false positive rates, which has led to increasing adoption throughout industry and government organizations. This in turn has motivated compiler teams to add support for plugins that can operate on internal program representations. There are large and active user communities that are documenting interfaces and creating libraries of plugins that can be combined to build complex analyzers. Indeed, the challenge is not whether an additive software analysis approach might work, but in which to invest and how to tie them together.<br  />
</p>
</div></li>

<li><a id="org6042dbb"></a><a id="org989fefd"></a> 2.3.7 Rationale for Potential Impact<br  /><div class="outline-text-5" id="text-org6042dbb">
<p>
Early static analysis tools checked mostly syntactic properties of programs, enforcing coding guidelines and looking for patterns that corresponded to simple runtime errors, such as dereferencing a null pointer or using a variable before assignment. As analyzers became more sophisticated, they increasingly relied on more complex analyses of program structure and data flow. Common frameworks that allow users to build small analysis engines that can share and combine results will make it possible to build sophisticated analyzers. Such analyzers can find subtle errors that are hard to find using traditional testing and simulation techniques.<br  />
</p>

<p>
Such frameworks and standards should allow modular and distributed development and permit existing modules to be replaced by superior ones. They should also facilitate synergy between groups of researchers. They should accelerate the growth of an "ecosystem" for tools and the development of next-generation "hybrid" tools. A hybrid tool might use a static analyzer module to find problematic code locations, and then use a constraint satisfier module and a symbolic execution engine to create inputs that trigger failures. A growing, shared set of problematic and virtuous programming patterns and idioms may ultimately be checked by tools <sup><a id="fnr.67" class="footref" href="#fn.67">67</a></sup>.<br  />
</p>
</div></li>

<li><a id="org7d893dd"></a><a id="org77c1a4e"></a> 2.3.8 Further Reading<br  /><div class="outline-text-5" id="text-org7d893dd">
</div></li></ul>
</div>
