dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<ul class="org-ul"><li><a id="orgc1beb44"></a><a id="orga6adf10"></a> 2.4.1 Rapid Framework Adoption<br  /><div class="outline-text-5" id="text-orgc1beb44">
<p>
Framework adoption is clearly impeded by the need to learn great quantities of accidental information. Gabriel defines "habitability" as "the characteristic of source code that enables programmers, coders, bug-fixers and people coming to the code later in its life to understand its construction and intentions and to change it comfortably and confidently." <sup><a id="fnr.74" class="footref" href="#fn.74">74</a></sup> Recognizing the challenge of achieving habitability, Gabriel suggests the use of software patterns to help developers quickly understand existing code, as well as to flag the use of negative practices. Although not a panacea, patterns (e.g. <sup><a id="fnr.75" class="footref" href="#fn.75">75</a></sup>) can help bridge the conceptual gap between framework providers and framework consumers. One approach to facilitating this is to develop a set of patterns that encompass popular domains. An informal survey in September 2016 of the top 10 most popular ("star'd") and most "forked" repositories on GitHub shows significant framework activity around Web application development, Front- end Web development, operating system kernels, cross platform application frameworks, virtual machine management, programming languages and asynchronous http servers. One approach to speeding adoption is to formulate software patterns for some of these domains, with a focus on harmonizing the accidental information between frameworks (so it need not be learned multiple times) and to produce documentation for common use cases. Experiments can then measure the effectiveness by comparing framework uptake both with and without the new pattern information.<br  />
</p>
</div></li>

<li><a id="orgc652b03"></a><a id="orge24bccb"></a> 2.4.2 Advanced Test Methods<br  /><div class="outline-text-5" id="text-orgc652b03">
<p>
With the unique exception of civil aviation (where software is built and tested according to stringent Federal Aviation Administration (FAA) standards), commercial software often receives only minimal testing. This is particularly true in industries where time to market is the predominant goal. Testing may be limited to only basic assurances that required functions have been implemented, sometimes called "happy path" or positive testing that demonstrates features, but does not provide assurance that undesirable behavior is absent.<br  />
</p>

<p>
Advanced testing approaches hold the promise to substantially increase framework robustness, and furthermore, to build assurance for compositions of frameworks under various assumptions regarding dependencies. Many frameworks currently employ only ad hoc testing. Others employ standard unit testing <sup><a id="fnr.70.100" class="footref" href="#fn.70">70</a></sup>, practiced at varying levels of completeness. Automated testing, such as QuickCheck <sup><a id="fnr.76" class="footref" href="#fn.76">76</a></sup> or various fuzzing tools, is available for most languages.<br  />
</p>

<p>
Recent advances in the measurement of traditional test suite coverage provide an opportunity to compare frameworks. Combinatorial testing compresses huge numbers of combinations of input values into a small number of tests <sup><a id="fnr.77" class="footref" href="#fn.77">77</a></sup>. The many ways in which frameworks may be customized or configured suggest a possible approach for gaining new confidence in the use of software frameworks. By demonstrating high quality compositions, such testing also has potential to highlight framework similarities, reduce learning curves and enable broader adoption of well-tested, well-analyzed code.<br  />
</p>
</div></li>

<li><a id="org80c1735"></a><a id="orgaf8cbe9"></a> 2.4.3 Conflict Resolution in Multi-Framework Composition<br  /><div class="outline-text-5" id="text-org80c1735">
<p>
In some cases, multiple frameworks can be used together concurrently without conflict. In others, the composition details that allow concurrent use may be fragile. Dominant framework patterns, such as inversion of control (IoC) <sup><a id="fnr.78" class="footref" href="#fn.78">78</a></sup>-also known as the Hollywood principle: "don't call us; we'll call you," may exacerbate this, because each framework may assume that it is defining the flow of control in an entire application. One approach for mitigating this is to virtualize framework operations using, for example, lightweight operating system containers <sup><a id="fnr.39.100" class="footref" href="#fn.39">39</a></sup> and then establish communication links between concurrently executing frameworks.<br  />
</p>

<p>
Another approach to conflict resolution is to employ software translation to rewrite frameworks, so that their overlapping elements become distinct. Pilot efforts can demonstrate the feasibility of these and other deconfliction strategies and compare their costs and effects on application vulnerability.<br  />
</p>
</div></li>

<li><a id="org4505bdb"></a><a id="org50f6539"></a> 2.4.4 Maturity Level<br  /><div class="outline-text-5" id="text-org4505bdb">
<p>
The literature of software patterns is quite extensive and software testing is a relatively mature subfield of computer science, practiced now for over 40 years. Frameworks themselves are now a dominant unit of software sharing. The three techniques listed above, patterns, testing and frameworks, are under continuous use and refinement.<br  />
</p>
</div></li>

<li><a id="org50e987f"></a><a id="org3b9bd15"></a> 2.4.5 Basis for Confidence<br  /><div class="outline-text-5" id="text-org50e987f">
<p>
There is little doubt that patterns can be documented for several significant frameworks; rapid uptake may be a more incremental than revolutionary improvement, but incremental improvements should flow from investments in pattern documentation. The advanced testing techniques that would be brought to bear on framework compositions, are relatively mature, increasing confidence that framework integrations can be effectively tested.<br  />
</p>
</div></li>

<li><a id="orga6af96a"></a><a id="orgad6bfa5"></a> 2.4.6 Rationale for Potential Impact<br  /><div class="outline-text-5" id="text-orga6af96a">
<p>
Code reuse is pervasive and seemingly accelerating; by investing in very popular frameworks, any improvements will be widely relevant.<br  />
</p>
</div></li>

<li><a id="org5f8c04f"></a><a id="orgbbbbd77"></a> 2.4.7 Further Reading<br  /><div class="outline-text-5" id="text-org5f8c04f">
</div></li></ul>
</div>
