dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-orgb8998b1" class="outline-4">
<h4 id="orgb8998b1"><a id="orgd88a993"></a> 2.5 Moving Target Defenses (MTD) and Automatic Software Diversity</h4>
<div class="outline-text-4" id="text-orgb8998b1">
<p>
This approach is a collection of techniques to automatically vary software's detailed structures and properties such that an attacker has much greater difficulty exploiting any weakness. To illustrate, consider one recently-proposed technique in this family: heap memory randomization <sup><a id="fnr.79" class="footref" href="#fn.79">79</a></sup>. When a program requests a buffer, the easiest thing is to return a chunk of the next available memory. This puts buffers in the same relative location. Knowing this, an attacker can exploit a buffer overflow weakness (i.e., BOF class) <sup><a id="fnr.25.100" class="footref" href="#fn.25">25</a></sup> in one buffer to, for instance, read the password in another buffer that is always 384 bytes beyond it. Heap memory randomization allocates a random additional amount of memory during each allocation. This puts buffers in different (unpredictable) relative locations, so that the above exploit is much harder or possibly impossible.<br  />
</p>

<p>
The goal of software diversity and moving target defense (MTD) is to reduce an attacker's ability to exploit vulnerabilities in software, not to reduce the number of weaknesses in software. This reduction may be achieved by changing the "attack surface," that is, the interface accessible by the attacker either across time (changes during operation) or across copies (diversity). Reduction may also include regenerating system components that have been compromised <sup><a id="fnr.80" class="footref" href="#fn.80">80</a></sup>.<br  />
</p>

<p>
Diversification must, of course, be safe. That is, changes have no effect on normal behavior, other than perhaps higher use of resources. Even with this constraint we can trade computing power for increased granularity or thoroughness of diversification. The increased granularity is presumed to offer better protection against exploitation of unknown vulnerabilities, because of the higher probability of affecting the location or value of some piece of information essential to an attack. This tradeoff is similar to that for static analysis, referred to in Sect. <a href="#org7243970">2.1.1</a> and 2.1.2: the more resources invested, the higher the amount of assurance. The difference is that static analysis finds specific vulnerabilities so that they can be corrected, while diversity-inducing transformations increase the difficulty of exploiting whole classes of vulnerabilities.<br  />
</p>
</div>

<ul class="org-ul"><li><a id="org2fd193a"></a><a id="org9911c63"></a> 2.5.1 Compile-Time Techniques<br  /><div class="outline-text-5" id="text-org2fd193a">
<p>
Compile-time techniques are those applied automatically by a compiler. They may result in the same executable for each compilation, such that the executable then chooses random behaviors or memory layouts at run time, or they may result in a different executable at each compilation.<br  />
</p>

<p>
Some specific techniques are data structure layout randomization, different orders of parameters in function calls, address space layout randomization (ASLR) <sup><a id="fnr.81" class="footref" href="#fn.81">81</a></sup>, instruction set randomization, data value randomization, application keyword tagging and varied instruction ordering with operation obfuscation and refactoring.<br  />
</p>

<p>
The program information that is useful for proving that these diversifications are safe is also useful for program analysis to find or remove vulnerabilities. The additive software analysis approach, detailed in Sect. <a href="#org88e5ece">2.3</a>, is to use the same computing power to simultaneously detect or remove weaknesses and to also randomize remaining weaknesses. These diversification techniques could be tied into a static analysis tool through the additive analysis framework, potentially with very modest resource expenditures.<br  />
</p>

<p>
Unfortunately, no tools do this today. Analysis software is usually run by the programmer, at development time. Diversification typically only displays its benefit in the system test phase or in the operation phase when it demonstrates resilience. At worst, diversification adds ambiguity to test results and makes it more difficult to track down root causes of failures. To counteract this disconnect between effort and benefit, programs that use diversification should be specifically acknowledged, so customers know that they employ an extra layer of resilience. Compilers that produced extremely diverse results would also reduce the chance of adversaries discovering vulnerabilities by examining differences between the new and previous versions of a program: they would be too different <sup><a id="fnr.82" class="footref" href="#fn.82">82</a></sup>.<br  />
</p>
</div></li>

<li><a id="org5e8c3b8"></a><a id="org6685d52"></a> 2.5.2 System or Network Techniques<br  /><div class="outline-text-5" id="text-org5e8c3b8">
<p>
Some techniques at the system or network level are network address space randomization and protocol diversity <sup><a id="fnr.83" class="footref" href="#fn.83">83</a></sup>. These are likely to be dynamic in that they change on a regular basis. In many cases, these are built on the assumption of a shared secret map from services to addresses or a shared secret key, so an application can authenticate and get current information.<br  />
</p>
</div></li>

<li><a id="orgd6b32fa"></a><a id="org01b29fe"></a> 2.5.3 Operating System Interface Techniques<br  /><div class="outline-text-5" id="text-orgd6b32fa">
<p>
An operating system (OS) may present different interfaces to different processes. These could be dynamic, such as a random interrupt number assigned for each system service, or static, in which the OS has several choices for each set of services. In the dynamic case, the linker/loader can adjust each new executable to the assignments made for the process. As an example of the static case, an OS presents a new process with a set of j memory management APIs, a set of k process services, a set of m networking functions and a set of n I/O calls. Invasive code trying to execute through that process would have to deal with j × k × m × n different OS interfaces to succeed.<br  />
</p>
</div></li>

<li><a id="org5549a62"></a><a id="org1d5eaa1"></a> 2.5.4 Maturity Level<br  /><div class="outline-text-5" id="text-org5549a62">
<p>
Some moving target defenses are the default in many operating systems and compilers today. There are intense research and entire conferences focused on understanding limitations, costs and benefits of current techniques and developing new and better techniques.<br  />
</p>
</div></li>

<li><a id="orge9b0036"></a><a id="org5a6f46e"></a> 2.5.5 Basis for Confidence<br  /><div class="outline-text-5" id="text-orge9b0036">
<p>
The benefit in terms of number of attacks foiled, attackers discouraged or additional attacker resources required is not known. However, many MTD techniques can be applied automatically, e.g. by the compiler, at little cost of resources or run time.<br  />
</p>
</div></li>

<li><a id="orgdcc0720"></a><a id="org7b125f2"></a> 2.5.6 Rationale for Potential Impact<br  /><div class="outline-text-5" id="text-orgdcc0720">
<p>
MTD techniques can be applied to most programs and systems today, even static embedded systems. Thus, the scope of benefits is extremely large. The impact is not clear since most techniques increase attacker's costs, not strictly eliminate vulnerabilities.<br  />
</p>
</div></li>

<li><a id="org1479483"></a><a id="org40553b3"></a> 2.5.7 Further Reading<br  /><div class="outline-text-5" id="text-org1479483">
</div></li></ul>
</div>
</div>
