dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-orgf61e253" class="outline-3">
<h3 id="orgf61e253"><a id="orgd764732"></a> 3 Measures and Metrics</h3>
<div class="outline-text-3" id="text-orgf61e253">
<p>
This section deals with measures, assessments, metrics, appraisals, judgements, evaluations, etc. in the broadest sense. Hence, code reviews, software testing and other techniques have a place in this section. As we discuss later, there is a dearth of precisely defined, rigorously validated measures. Worse, most existing measures are only moderately predictive of the high-level properties that we wish to determine in software. There is not even extensive and detailed data, such as numbers and types of vulnerabilities, upon which measurement research might be based.<br  />
</p>

<p>
We have three areas of attention. First, encouraging the use of measures. All the extraordinary measures in the world do not help if nobody uses them. Also, nobody can act on measures if the measures are not produced and available. The Federal Government might motivate and encourage the use of software product measures. Vehicles include procurement, contracting, liability, insurance and also standards, as explained in Sect. <a href="#org60ac612">4.3</a>. The benefit of measures is amplified when they are revised, interpreted and used in a disciplined software development process <sup><a id="fnr.84" class="footref" href="#fn.84">84</a></sup>. Indeed, the widespread use of good measures is one of the few ways with the potential to break out of the cycle of crash-and-patch and get ahead of attackers <sup><a id="fnr.6.100" class="footref" href="#fn.6">6</a></sup>.<br  />
</p>

<p>
Software can also benefit from the programs and criteria of third-party, non-governmental organizations. Some possibilities are UL Cybersecurity Assurance Program (CAP), Consortium for IT Software Quality (CISQ) Code Quality Standards, Coverity Scan, Core Infrastructure Initiative (CII) Best Practices badge and the Building Security In Maturity Model (BSIMM). Many of these include process measures, which is the second area of attention.<br  />
</p>

<p>
The second area, process measures, includes hours of effort, number of changes with no acceptance test defects and acceptance test defect density in delivered code <sup><a id="fnr.85" class="footref" href="#fn.85">85</a></sup>. These do not have a direct effect on the number of vulnerabilities, but the indirect effects are significant.<br  />
</p>

<p>
For example, if developers are forced to frequently work overtime to meet a deadline or the schedule does not allow for training, the number of vulnerabilities is likely to be much higher <sup><a id="fnr.85.100" class="footref" href="#fn.85">85</a></sup>. Other examples are measures that indicate how much a new process step helps compared to the former practice or that indicate parts of the process that are allowing vulnerabilities to escape. This approach of continuously improving the process is found in the highest levels of maturity models. It also allows groups to adopt or adapt methods and measures that are most applicable to their circumstance. We do not discuss process measures further.<br  />
</p>

<p>
The final area of attention is measures of software as a product, for instance, proof of absence of buffer overflows, number of defects per thousand lines of code, assurance that specifications are met and path coverage achieved by a test suite. The Software Quality Group at the U.S. National Institute of Standards and Technology (NIST) organized a workshop on Software Measures and Metrics to Reduce Security Vulnerabilities (SwMM-RSV) to gather ideas on how the Federal Government can best identify, improve, package, deliver or boost the use of software measures to significantly reduce vulnerabilities <sup><a id="fnr.86" class="footref" href="#fn.86">86</a></sup>. They called for short position statements, and then invited workshop presentations based on 10 of the 20 statements submitted. The workshop was held on 12 July 2016. The full workshop report is available as NIST SP 500-320 <sup><a id="fnr.87" class="footref" href="#fn.87">87</a></sup>.<br  />
</p>

<p>
Much of this section is informed by the results of the workshop. Ideas were often brought up by one person, discussed and elaborated by others, then written or reported by yet others. Hence, it is difficult to attribute ideas to particular people in most cases. We thank all those who participated in the workshop and made contributions, large and small, to the ideas noted in the report.<br  />
</p>

<p>
We distinguish between base measures and derived measures. A base measure is a simple, basic assessment or count with a clear value. A derived measure, on the other hand, is "a function of two or more values of base measures" <sup><a id="fnr.88" class="footref" href="#fn.88">88</a></sup> or a mathematical transformation of a base measure <sup><a id="fnr.89" class="footref" href="#fn.89">89</a></sup>. Derived measures are often surrogates for properties that we would like to be able to determine. For instance, number of buffer overflow (BOF class) <sup><a id="fnr.25.100" class="footref" href="#fn.25">25</a></sup> weaknesses is a base measure with a reasonably clear definition. In contrast, code security is a derived measure that is only weakly predicted by the number of BOFs. The absence of flaws does not indicate the presence of excellence.<br  />
</p>
</div>
