dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-orge7ba6ef" class="outline-4">
<h4 id="orge7ba6ef"><a id="orgf1a870d"></a> 3.2 Software Assurance: The Object of Software Measures</h4>
<div class="outline-text-4" id="text-orge7ba6ef">
<p>
Assurance that software will function as it should, comes from three sources. The first is the development process. If software is developed by a team who has clear requirements, are well trained and have demonstrated building good software with low vulnerability rates, then we have confidence or assurance that software they produce is likely to have few vulnerabilities. The second source of assurance is our analysis of the software. For instance, code reviews, acceptance tests and static analysis can assure us that vulnerabilities are likely to be rare in the software. We can trade off these two sources of assurance. If we have little information about the development process or the development process has not yielded good software in the past, we must do much more analysis and testing to achieve confidence in the quality of the software. In contrast, if we have confidence in the development team and the development process, we only need to do minimal analysis in order to be sure that the software follows past experience.<br  />
</p>

<p>
The third source of software assurance is a resilient execution environment. If we do not have confidence in the quality of the software, then we can run it in a container, as explained in Sect. <a href="#orgf7faec0">2.2.1</a>, give it few system privileges and have other programs monitor the execution. If any vulnerabilities are triggered, the damage to the system is controlled.<br  />
</p>

<p>
We may express our assurance with a mathematical formula: <code>A = f(p, s, e)</code>, where <code>A</code> is the amount of assurance we have, <code>p</code> is the assurance that comes from our knowledge of the process, <code>s</code> is assurance from static and dynamic analysis and <code>e</code> is the assurance that we gain from strict execution environments. The combining function, <code>f</code>, is some additive operation, akin to <code>p + s + e</code>.<br  />
</p>

<p>
As we said before, if we do not have information about the process, then extra work in analysis can raise our overall assurance. On the other hand, if we have great confidence in the process (and people) that developed the software, we do not need as much work in analysis.<br  />
</p>
</div>
</div>

<div id="outline-container-orgab9e9fa" class="outline-4">
<h4 id="orgab9e9fa"><a id="orga09a083"></a> 3.3 Software Metrology</h4>
<div class="outline-text-4" id="text-orgab9e9fa">
<p>
To have a coherent, broadly useful system of measures, one must have a solid theoretical foundation, that is, a philosophy of software measurement. This philosophy must have a solid mathematical foundation, for instance, to use sensible statistics <sup><a id="fnr.96" class="footref" href="#fn.96">96</a></sup>. This section addresses questions such as, what is software metrology? What is its purpose? What are the challenges unique to measuring software, in contrast to physical measurement? What are possible solutions or potential approaches?<br  />
</p>

<p>
Software measures have well-known theoretical limitations. Analogous to Heisenberg's Uncertainty Principle in Physics, Computer Science has the Halting Problem, Rice's Theorem and related results that show that it is impossible to correctly determine interesting measures for all possible programs. Although this is a caution, it does not mean that all useful, precise, accurate measurement is impossible. There are several ways to avoid these theoretical road blocks. First, we may be satisfied with relative properties. It may be helpful to be able to determine that the new version of a program is more secure (or less!) than the previous version. We need not have an absolute measure of the security of a program. Second, a measure might apply only to programs that have "reasonable" structures. A measure may still be useful even if it does not apply to programs consisting solely of millions of conditional go-to statements with seemingly capricious computations interspersed. Nobody (should) write programs like that. Finally, society may decide that for certain applications, we will only build measurable software. Civil architects are not allowed to design buildings with arbitrary arches, domes, cantilevers and facades. They are required to run analyses showing that the design withstands expected loads and forces before construction can start. Currently most programmers learn to write "elegant" software, then try to show that it works. The expectation might change so that professionals only write software that definitely satisfies its constraints and requirements.<br  />
</p>

<p>
Computer programmers use the phrase "it's not a bug: it's a feature" half-seriously. Its use highlights that bugs and features are entities that are related somehow. Let us assume that a program can be characterized as a set of features. (The notion that a program is a set of features is the basis of some size measures. For example, the Function Point measure attempts to capture the notion of a basic operation or function.) Saying that a program "has a bug" means it is a buggy version of a "good" program. Both the good program and the buggy version are programs. According to the assumption, both programs are a set of features. Therefore, the difference between the good program and the buggy program is some set of features &#x2013; features added, removed, or changed. Hence, a precise definition is that a bug is the difference between the features desired and the features present. In many cases, a bug may merely be an additional feature or one feature replacing another.<br  />
</p>

<p>
We might contrast software metrology with physical metrology. In physical metrology the challenge is to precisely and reproducibly determine the properties of physical objects, events or systems. For software, on the other hand, most of the so-called measurement is merely counting. A case in point is that ASCMM-MNT-7: Inter-Module Dependency Cycles has a precise definition <sup><a id="fnr.97" class="footref" href="#fn.97">97</a></sup>. It is not difficult to write a program that precisely measures the number of instances where a module has references that cycle back a piece of software. The difference then is that physical metrology has clearly identified the properties that they want to determine, for instance, mass, length, duration and temperature. In contrast, software metrology has a distinct gap. We want to measure high-level properties, such as quality, maintainability and security, but we do not have precise definitions of those. Therefore, we cannot measure them directly. We can, however, measure many properties that are correlated with those high-level properties.<br  />
</p>

<p>
Currently metrology relegates counting the number of entities to a second-class method of determining properties. Such counted quantities are all considered to be the same dimension one, sometimes called dimensionless quantities, although they may be different kinds.<br  />
</p>
</div>
</div>
