dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-orged91d21" class="outline-4">
<h4 id="orged91d21"><a id="orga8c6a34"></a> 3.4 Product Measures</h4>
<div class="outline-text-4" id="text-orged91d21">
<p>
As much as good process is essential to the production of code with few vulnerabilities, the ultimate capability is to measure the code itself. As pointed out in the introduction to this section, measures of the software itself inform process improvement.<br  />
</p>

<p>
Security or vulnerability measurement in the broadest sense includes both testing and checking. We need such measurements to determine whether the goals of this report are met! Adopting any one technique given in this report may not reduce vulnerabilities dramatically. The lack of reduction may merely be the result of certain details of how the technique is employed, or it may be that the technique is just not applicable. When several techniques are adopted, it is even harder to distinguish the effects of each or joint effects.<br  />
</p>

<p>
Such measurement cannot be left until the final deployment. They must be included in all phases of software development. Except for ambitious approaches like the Clean Room approach <sup><a id="fnr.98" class="footref" href="#fn.98">98</a></sup>, this kind of measurement cannot be left as a gate near the end of the production cycle.<br  />
</p>

<p>
It is possible that software quality and security measures may be the wrong emphasis to reduce software vulnerabilities. Such measures may fade in emphasis as other software measures have, for example cohesion and McCabe Cyclomatic Complexity. It may turn out that the best approach is like Clean Room, in which measures inform a decision to accept or reject and do not purport to establish an absolute certification of freedom from errors.<br  />
</p>
</div>

<ul class="org-ul"><li><a id="orgf40f4bf"></a><a id="orgc462c73"></a> 3.4.1 Existing Measures<br  /><div class="outline-text-5" id="text-orgf40f4bf">
<p>
There are hundreds of proposed software measures, such as lines of code, class coupling, number of closed classes, function points, change density and cohesion. Most of these are not precisely defined and are not rigorously validated. Worse yet, most of these are only moderately predictive of the high-level properties that we wish to determine in software. For instance, lines of code (LoC) capture only some of the variance in program capability. LoC for the same specification in the same language varies by as much as a factor of four, even when all programmers have similar expertise. On the other hand, LoC has a remarkably robust correlation with the number of bugs in a program. (This suggests that higher level and domain-specific languages, which allow a programmer to express functionality more succinctly, lead to fewer bugs in general.)<br  />
</p>

<p>
Even something as seemingly simple as counting the number of bugs in a program is surprisingly complicated <sup><a id="fnr.99" class="footref" href="#fn.99">99</a></sup>. It is difficult to even subjectively define what is a bug. For example, one can write a binary search that is never subject to integer overflow, but the code is hard to understand. Dividing by zero may have a well-defined behavior, resulting in the special value "NaN," but that is generally not a useful result. Bugs are often a cascade of several difficulties. Suppose (1) an unchecked user input leads to (2) an integer overflow that leads to (3) a buffer being allocated that is too small that causes (4) a buffer overflow that finally leads to (5) information exposure. Do we count this as one bug or five? If a programmer makes a systematic mistake in several places, e.g., not releasing a resource after use, is that one problem or several? Rather than being the exception, these kinds of complications are the rule in software <sup><a id="fnr.100" class="footref" href="#fn.100">100</a></sup>.<br  />
</p>

<p>
For any realistic program, it is infeasible to test every single possible input. Instead, one must choose a measure that spans the entire space. Some of these measures are combinatorial coverage of input space <sup><a id="fnr.101" class="footref" href="#fn.101">101</a></sup>, mutation adequacy <sup><a id="fnr.93.100" class="footref" href="#fn.93">93</a></sup>, path coverage measures <sup><a id="fnr.94.100" class="footref" href="#fn.94">94</a></sup> and boundary value analysis <sup><a id="fnr.92.100" class="footref" href="#fn.92">92</a></sup>. These measures are interrelated. For instance, certain levels of (static) combinatorial coverage produce tests that yield complete branch coverage, a dynamic measure <sup><a id="fnr.102" class="footref" href="#fn.102">102</a></sup>.<br  />
</p>

<p>
There are far too many proposed measures to evaluate or even list here. We can state that, as alluded to above, measures should be firmly based on well-established science and have a rational foundation in metrology to have the greatest utility <sup><a id="fnr.103" class="footref" href="#fn.103">103</a></sup>.<br  />
</p>
</div></li>

<li><a id="orgf1dce03"></a><a id="org13d3884"></a> 3.4.2 Better Code<br  /><div class="outline-text-5" id="text-orgf1dce03">
<p>
Two presentations at the Software Measures and Metrics to Reduce Security Vulnerabilities (SwMM-RSV) workshop, Andrew Walenstein's "Measuring Software Analyzability" and James Kupsch's "Dealing with Code that is Opaque to Static Analysis," point the direction to new software measures. Both stressed that code should be amenable to automatic analysis. Both presented approaches to define what it means that code is readily analyzed, why analyzability contributes to reduced vulnerabilities and how analyzability could be measured and increased. There are subsets of programming languages that are designed to be analyzable, such as SPARK, or to be less error-prone, such as Less Hatton's SaferC. Workshop participants generally favored using better languages, for example, functional languages, such as F# or ML. However, there was no particular suggestion of the language, or languages, of the future.<br  />
</p>

<p>
We note that with few exceptions, such as Ada 2012 <sup><a id="fnr.104" class="footref" href="#fn.104">104</a></sup>, which has SPARK, new languages have poor tool support. Supporting the construction of tools is vital for the adoption and safe use of new languages.<br  />
</p>

<p>
While code-based measures are important, we can expect complementary results from measures for other aspects of software. Some aspects are the software architecture and design erosion measures, linguistic aspects of the code, developers' backgrounds and measures related to the software requirements.<br  />
</p>
</div></li>

<li><a id="org1fcbef2"></a><a id="org129b211"></a> 3.4.3 Measures of Binaries and Executables<br  /><div class="outline-text-5" id="text-org1fcbef2">
<p>
Some workshop participants were of the opinion that there is a significant need for measures of binaries or executables. With today's optimizing compilers and with the dependence on many libraries delivered in binary, solely examining source code leaves many avenues for appearance of all sorts of vulnerabilities.<br  />
</p>
</div></li>

<li><a id="org4ed3a1e"></a><a id="org9923c03"></a> 3.4.4 More Useful Tool Outputs<br  /><div class="outline-text-5" id="text-org4ed3a1e">
<p>
There are many powerful and useful software assurance tools available today. No single tool meets all needs. Accordingly, users should use several tools. This is difficult because tools have different output formats and use different terms and classes. Tool outputs should be standardized. That is, the more there is common nomenclature, presentation and detail, the more feasible it is for users to combine tool results with other software assurance information and to choose a combination of tools that is most beneficial for them.<br  />
</p>

<p>
In addition, tools can supply more information about their analysis. Tools could indicate which parts of code are thoroughly checked and which parts are not, for instance, because of complexity or heuristics. This checking information could be attached to the code as "assurance- carrying code" <sup><a id="fnr.61.100" class="footref" href="#fn.61">61</a></sup>, analogous to proof-carrying code.<br  />
</p>

<p>
Participants felt the need for scientifically valid research about tool strengths and limitations, mechanisms to allow publication of third party evaluation of tools, a common forum to share insights about tools and, perhaps, even a list of verified or certified tools.<br  />
</p>
</div></li></ul>
</div>
