dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-org1c7d070" class="outline-4">
<h4 id="org1c7d070"><a id="orge0b8ae8"></a> 3.5 Further Reading</h4>
<div class="outline-text-4" id="text-org1c7d070">
</div>
</div>
</div>

<div id="outline-container-org6520570" class="outline-3">
<h3 id="org6520570"><a id="orgc654061"></a> 4 Non-Technical Approaches and Summary</h3>
<div class="outline-text-3" id="text-org6520570">
<p>
In response to the February 2016 Federal Cybersecurity Research and Development Strategic Plan, OSTP asked NIST to identify ways to dramatically reduce software vulnerabilities. NIST worked with the software assurance community to identify five promising approaches. This report presents some background for each of the approaches along with a summary statement of the maturity of the approach and the rationale for why it might make a dramatic difference. Further reading was provided for each approach. Hopefully other approaches will be identified in the future.<br  />
</p>

<p>
These approaches are focused on technical activities with a three to seven-year horizon. Many critical aspects of improving software, such as creating better specifications, using the testing tools available today, understanding and controlling dependencies and creating and following project guidelines, were not addressed. While these areas fall outside the scope of the report, they are critical both now and in the future. Similarly, the report does not address research and development that is needed as part of a broader understanding of software and vulnerabilities. Topics such as identifying sources of vulnerabilities, how vulnerabilities manifest as bugs and improved scanning during development are also critical, but, again, outside the scope of this report.<br  />
</p>

<p>
This section of the report outlines some of the needed steps for moving forward by engaging the broader community, including researchers, funders, developers, managers and customers/users. This section addresses: 1) engaging and supporting the research community, 2) education and training and 3) empowering customers and users of software to meaningfully participate by not only asking for quality, but pushing it.<br  />
</p>
</div>

<div id="outline-container-orgd0c0632" class="outline-4">
<h4 id="orgd0c0632"><a id="orgbce832d"></a> 4.1 Engaging the Research Community</h4>
<div class="outline-text-4" id="text-orgd0c0632">
<p>
There are many approaches to engaging the research community beyond simply funding secure software research.<br  />
</p>
</div>

<ul class="org-ul"><li><a id="org7125928"></a><a id="orgca844e1"></a> 4.1.1 Grand Challenges, Prizes and Awards<br  /><div class="outline-text-5" id="text-org7125928">
<p>
Many organizations have announced grand challenges, some of which are general research goals and some are competitions. More secure software can be the focus of challenges or a side benefit, that is, the competition could be focused on a non-security goal, but require the winner to produce secure software. For example, the DARPA Cyber Grand Challenge scores reflected how well software found vulnerabilities and protected the host <sup><a id="fnr.105" class="footref" href="#fn.105">105</a></sup>. Other challenges might focus on particular techniques, such as abstract interpretation or symbolic execution or analysis of new programming languages. Many organizations use bug bounty programs to provide incentives to the research community to find and notify organizations about bugs.<br  />
</p>
</div></li>

<li><a id="org300b010"></a><a id="org3cb17b6"></a> 4.1.2 Research Infrastructure<br  /><div class="outline-text-5" id="text-org300b010">
<p>
There are several very successful repositories of data related to secure software, such as the National Vulnerability Database. However, many more are needed. There could be repositories to share related research as well as open repositories of source code, as mentioned in Sect. <a href="#org289522c">4.3.6</a>. There is also a need for a better understanding of weaknesses and bugs. For example, what proportion of vulnerabilities result from implementation errors and what proportion from design errors? The SPSQ workshop participants called for more in-depth understanding of defects and vulnerabilities. Specific issues included the need for empirical data about the types and prevalence of vulnerabilities, the effectiveness of programming and testing techniques and the benefits and costs of "safer" languages. New languages require new analysis tools and, in some cases, new analysis algorithms. A robust research infrastructure can also be used to study other factors that may affect software quality, including management practices, education and training, levels of complexity and programmer overload. Researchers need to be able to replicate results and test across different types of code. All of these activities require a large and public research infrastructure.<br  />
</p>
</div></li></ul>
</div>
