dramatically_reducing_software_vulnerabilities/NIST.IR.8151.org
*** <<4.2>> 4.2 Education and Training

The role of education and training cannot be overstated. There is no technological substitute for developer discipline. Education is not just about teaching developers how to write better software. It also includes educating users how to specify better software and managers how to set up environments that result in higher quality software.

In addition, education and training are the primary mechanism for transitioning the technical approaches discussed in this report from the research community to both the development community and to the user/customer community.

Education and training for the developer community needs to address both up-and-coming developers currently in the educational system, as well as current developers who need to update their skills.

Over the past couple of years, there has been a shift in focus in higher education to include a greater emphasis on designing software with security built in from the beginning rather than added afterwards. K-12 education has also seen growth in cybersecurity efforts - both from the user and producer perspectives. It is clear that computer science and cybersecurity come together in the issue of secure programming. Understanding the principles of cybersecurity are essential to making sure that software is secure and usable. More and more academic programs are educating their students to program with security in mind.

Current developers need to be exposed to new approaches and techniques. In order for developers to make changes, they need to see evidence that the new approaches and techniques will be effective, as well as training material. To complement the training of front-line software developers, managers and executives must also be educated in the risk management implications of software vulnerabilities and the importance of investing in cybersecurity and low vulnerability software. In order for this training to be successful, it, too, will require evidence that investment in secure software will be cost effective.

It is currently unknown which pedagogical techniques are most effective. Early research has shown that providing developers with a better understanding of weaknesses creates better programs [fn:Wu11]. Additional research, as well as training material ranging from use cases to how-to guides, will be needed for successful transition. The Federal Government can lead by example by training its developer community.

The National Initiative for Cybersecurity Education (NICE)'s strategic plan [fn:Plan16] lays out three goals for improving education and training.

Accelerate Learning and Skills Development. It is critical to inspire a sense of urgency in both the public and private sectors to address the shortage of skilled cybersecurity workers. Needed steps include:

+ Stimulating the development of approaches and techniques that can more rapidly increase the supply of qualified cybersecurity workers;
+ Advancing programs that reduce the time and cost for obtaining knowledge, skills and abilities for in-demand work roles;
+ Engaging displaced workers or underemployed individuals who are available and motivated to assume cybersecurity work roles;
+ Experimenting with the use of apprenticeships and cooperative education programs to provide an immediate workforce that can earn a salary while they learn the necessary skills and
+ Exploring methods to identify gaps in cybersecurity skills and raise awareness of training that addresses identified workforce needs.

Nurture a Diverse Learning Community. There is a need to strengthen education and training across the ecosystem to emphasize learning, measure outcomes and diversify the cybersecurity workforce. Needed steps include:

+ Improving education programs, co-curricular experiences and training and certifications;
+ Encouraging tools and techniques that effectively measure and validate individual aptitude, knowledge, skills and abilities;
+ Inspiring cybersecurity career awareness with students in elementary school, stimulate cybersecurity career exploration in middle school and enable cybersecurity career preparedness in high school;
+ Growing creative and effective efforts to increase the number of women, minorities, veterans, persons with disabilities and other underrepresented populations in the cybersecurity workforce and
+ Facilitating the development and dissemination of academic pathways for cybersecurity careers.

Guide Career Development and Workforce Planning. Employers need help to address market demands and enhance recruitment, hiring, development and retention of cybersecurity talent. Needed steps include:

+ Identifying and analyze data sources that support projecting present and future demand and supply of qualified cybersecurity workers;
+ Publishing and raising awareness of the National Cybersecurity Workforce Framework and encourage adoption;
+ Facilitating state and regional consortia to identify cybersecurity pathways addressing local workforce needs;
+ Promoting tools that assist human resource professionals and hiring managers with recruitment, hiring, development and retention of cybersecurity professionals and
+ Collaborating internationally to share best practices in cybersecurity career development and workforce planning.

*** <<4.3>> 4.3 Consumer-Enabling Technology Transfer

One of the drivers for better software is if users, consumers and purchasers of software demand it. While the user community clearly wants higher quality software, it is difficult for them to meaningfully ask for it and know if they received it, and thus signal the development of low vulnerability software. The market needs improved measures that are customer-focused, as well as other policy and economic approaches. For a measure to significantly inform customers, it requires pervasiveness, understandability, simplicity and efficiency. An example is the 5-Star Safety Rating of the National Highway Traffic Safety Administration (NHTSA). Once ratings consistently appeared on new automobiles, one- and two-star rated cars rapidly became scarce [fn:Rice08]. Policy and economic approaches are outside the scope of this report, but they are critical to successful technology transfer for improved software. This section outlines some of these approaches that were discussed during the various workshops.

**** <<4.3.1>> 4.3.1 Contracting and Procurement

The Federal Government could lead a significant improvement in software quality by requiring software quality during contracting and procurement and by changing general expectations. Model contract language can include incentives for software to adhere to higher coding and assurance standards or punitive measures for egregious violations of those standards. Sample procurement language for cybersecurity and secure software has been published by the defense community [fn:Marien16], the financial sector, the automotive sector and the medical sector. The evaluation must include provisions for "fitness for purpose" that factor in considerations for secure software.

