dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-org2ab8893" class="outline-4">
<h4 id="org2ab8893"><a id="org80ad134"></a> 4.2 Education and Training</h4>
<div class="outline-text-4" id="text-org2ab8893">
<p>
The role of education and training cannot be overstated. There is no technological substitute for developer discipline. Education is not just about teaching developers how to write better software. It also includes educating users how to specify better software and managers how to set up environments that result in higher quality software.<br  />
</p>

<p>
In addition, education and training are the primary mechanism for transitioning the technical approaches discussed in this report from the research community to both the development community and to the user/customer community.<br  />
</p>

<p>
Education and training for the developer community needs to address both up-and-coming developers currently in the educational system, as well as current developers who need to update their skills.<br  />
</p>

<p>
Over the past couple of years, there has been a shift in focus in higher education to include a greater emphasis on designing software with security built in from the beginning rather than added afterwards. K-12 education has also seen growth in cybersecurity efforts - both from the user and producer perspectives. It is clear that computer science and cybersecurity come together in the issue of secure programming. Understanding the principles of cybersecurity are essential to making sure that software is secure and usable. More and more academic programs are educating their students to program with security in mind.<br  />
</p>

<p>
Current developers need to be exposed to new approaches and techniques. In order for developers to make changes, they need to see evidence that the new approaches and techniques will be effective, as well as training material. To complement the training of front-line software developers, managers and executives must also be educated in the risk management implications of software vulnerabilities and the importance of investing in cybersecurity and low vulnerability software. In order for this training to be successful, it, too, will require evidence that investment in secure software will be cost effective.<br  />
</p>

<p>
It is currently unknown which pedagogical techniques are most effective. Early research has shown that providing developers with a better understanding of weaknesses creates better programs <sup><a id="fnr.106" class="footref" href="#fn.106">106</a></sup>. Additional research, as well as training material ranging from use cases to how-to guides, will be needed for successful transition. The Federal Government can lead by example by training its developer community.<br  />
</p>

<p>
The National Initiative for Cybersecurity Education (NICE)'s strategic plan <sup><a id="fnr.107" class="footref" href="#fn.107">107</a></sup> lays out three goals for improving education and training.<br  />
</p>

<p>
Accelerate Learning and Skills Development. It is critical to inspire a sense of urgency in both the public and private sectors to address the shortage of skilled cybersecurity workers. Needed steps include:<br  />
</p>

<ul class="org-ul">
<li>Stimulating the development of approaches and techniques that can more rapidly increase the supply of qualified cybersecurity workers;<br  /></li>
<li>Advancing programs that reduce the time and cost for obtaining knowledge, skills and abilities for in-demand work roles;<br  /></li>
<li>Engaging displaced workers or underemployed individuals who are available and motivated to assume cybersecurity work roles;<br  /></li>
<li>Experimenting with the use of apprenticeships and cooperative education programs to provide an immediate workforce that can earn a salary while they learn the necessary skills and<br  /></li>
<li>Exploring methods to identify gaps in cybersecurity skills and raise awareness of training that addresses identified workforce needs.<br  /></li>
</ul>

<p>
Nurture a Diverse Learning Community. There is a need to strengthen education and training across the ecosystem to emphasize learning, measure outcomes and diversify the cybersecurity workforce. Needed steps include:<br  />
</p>

<ul class="org-ul">
<li>Improving education programs, co-curricular experiences and training and certifications;<br  /></li>
<li>Encouraging tools and techniques that effectively measure and validate individual aptitude, knowledge, skills and abilities;<br  /></li>
<li>Inspiring cybersecurity career awareness with students in elementary school, stimulate cybersecurity career exploration in middle school and enable cybersecurity career preparedness in high school;<br  /></li>
<li>Growing creative and effective efforts to increase the number of women, minorities, veterans, persons with disabilities and other underrepresented populations in the cybersecurity workforce and<br  /></li>
<li>Facilitating the development and dissemination of academic pathways for cybersecurity careers.<br  /></li>
</ul>

<p>
Guide Career Development and Workforce Planning. Employers need help to address market demands and enhance recruitment, hiring, development and retention of cybersecurity talent. Needed steps include:<br  />
</p>

<ul class="org-ul">
<li>Identifying and analyze data sources that support projecting present and future demand and supply of qualified cybersecurity workers;<br  /></li>
<li>Publishing and raising awareness of the National Cybersecurity Workforce Framework and encourage adoption;<br  /></li>
<li>Facilitating state and regional consortia to identify cybersecurity pathways addressing local workforce needs;<br  /></li>
<li>Promoting tools that assist human resource professionals and hiring managers with recruitment, hiring, development and retention of cybersecurity professionals and<br  /></li>
<li>Collaborating internationally to share best practices in cybersecurity career development and workforce planning.<br  /></li>
</ul>
</div>
</div>

<div id="outline-container-orgdb79b66" class="outline-4">
<h4 id="orgdb79b66"><a id="org60ac612"></a> 4.3 Consumer-Enabling Technology Transfer</h4>
<div class="outline-text-4" id="text-orgdb79b66">
<p>
One of the drivers for better software is if users, consumers and purchasers of software demand it. While the user community clearly wants higher quality software, it is difficult for them to meaningfully ask for it and know if they received it, and thus signal the development of low vulnerability software. The market needs improved measures that are customer-focused, as well as other policy and economic approaches. For a measure to significantly inform customers, it requires pervasiveness, understandability, simplicity and efficiency. An example is the 5-Star Safety Rating of the National Highway Traffic Safety Administration (NHTSA). Once ratings consistently appeared on new automobiles, one- and two-star rated cars rapidly became scarce <sup><a id="fnr.108" class="footref" href="#fn.108">108</a></sup>. Policy and economic approaches are outside the scope of this report, but they are critical to successful technology transfer for improved software. This section outlines some of these approaches that were discussed during the various workshops.<br  />
</p>
</div>

<ul class="org-ul"><li><a id="org641ef80"></a><a id="orgc506ac4"></a> 4.3.1 Contracting and Procurement<br  /><div class="outline-text-5" id="text-org641ef80">
<p>
The Federal Government could lead a significant improvement in software quality by requiring software quality during contracting and procurement and by changing general expectations. Model contract language can include incentives for software to adhere to higher coding and assurance standards or punitive measures for egregious violations of those standards. Sample procurement language for cybersecurity and secure software has been published by the defense community <sup><a id="fnr.109" class="footref" href="#fn.109">109</a></sup>, the financial sector, the automotive sector and the medical sector. The evaluation must include provisions for "fitness for purpose" that factor in considerations for secure software.<br  />
</p>
</div></li>
