dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<li><a id="orgb225e6b"></a><a id="org789663f"></a> 4.3.2 Liability<br  /><div class="outline-text-5" id="text-orgb225e6b">
<p>
There is much discussion in the software community about liability, including during the Software Measures and Metrics to Reduce Security Vulnerabilities (SwMM-RSV) workshop.<br  />
</p>

<p>
Many participants felt that companies developing software should be contractually liable for vulnerabilities discovered after delivery. Many did not believe that there should be legal liability at this time. On the other hand, the language of such liability clauses needs to be strict enough to, as one participant wrote, "hold companies accountable for sloppy and easily-avoidable errors, flaws and mistakes."<br  />
</p>

<p>
Defining "sloppy and easily avoidable" is not a trivial matter. An additional complicating factor is that liability includes a concept of who is responsible. Responsibility may be hard to determine in the case of "open source" or freely available software.<br  />
</p>
</div></li>

<li><a id="org1a3e281"></a><a id="org0737e99"></a> 4.3.3 Insurance<br  /><div class="outline-text-5" id="text-org1a3e281">
<p>
Cyber insurance is a growing area as cyber continues to grow in importance. The Financial Services Sector Coordinating Council (FSSCC) for Critical Infrastructure Protection and Homeland Security produced a 26-page document, entitled "Purchasers' Guide to Cyber Insurance Products," defining what this kind of insurance is, explaining why organizations need it, describing how it can be procured and giving other helpful information.<br  />
</p>
</div></li>

<li><a id="orgc43bb37"></a><a id="org3c24760"></a> 4.3.4 Vendor-Customer Relations<br  /><div class="outline-text-5" id="text-orgc43bb37">
<p>
It would help end users if software has a "bill of materials" such that those using it could respond to a new threat in which some part of the software became a vector of attack. Users are sometimes prohibited by software licenses from publishing evaluations or comparisons with other tools. Georgetown University recently published a study of this issue <sup><a id="fnr.22.100" class="footref" href="#fn.22">22</a></sup>. The study was sponsored by the Department of Homeland Security (DHS) Science &amp; Technology Directorate (S&amp;T), Cyber Security Division through the Security and Software Engineering Research Center (S2ERC).<br  />
</p>
</div></li>

<li><a id="org0b24c43"></a><a id="orgf27f8d4"></a> 4.3.5 Standards<br  /><div class="outline-text-5" id="text-org0b24c43">
<p>
The development and adoption of standards and guidelines, as well as conformity assessment programs, are used across multiple industries to address quality. The US system of voluntary industry consensus standards allows for great flexibility to address needs. In some cases, the Government (federal, state or local) set regulatory standards and communities self-regulate. For example, the Institute of Electrical and Electronics Engineers (IEEE) released a Building Code for Medical Device Software Security in 2015 <sup><a id="fnr.110" class="footref" href="#fn.110">110</a></sup> and has launched an effort to develop a similar best practice document for energy and power distribution systems. Carl Landwehr proposed a "building code for building code" <sup><a id="fnr.111" class="footref" href="#fn.111">111</a></sup>. Another example is NIST's Framework for Improving Critical Infrastructure Cybersecurity <sup><a id="fnr.112" class="footref" href="#fn.112">112</a></sup>.<br  />
</p>
</div></li>

<li><a id="orgf37c934"></a><a id="org289522c"></a> 4.3.6 Testing and Code Repositories<br  /><div class="outline-text-5" id="text-orgf37c934">
<p>
We explained the advantages of additional repositories of well-tested code in both Sections 2.1 and 2.4. In-depth testing of software is difficult and time-consuming, but necessary for key modules that are in common usage. Participants at the SPSQ workshop pointed out the value of both government and community-based efforts to test critical software. Code repositories promote code re-use and encourage organizations to test code by providing a location where the results can be published. Repositories could store some assurance level measure along with the code or even have built-in code measures tools. Repositories can also contain examples of projects with low bug densities, such as Tokeneer <sup><a id="fnr.14.100" class="footref" href="#fn.14">14</a></sup>.<br  />
</p>
</div></li>

<li><a id="org365b667"></a><a id="org18e8b84"></a> 4.3.7 Threat Analysis<br  /><div class="outline-text-5" id="text-org365b667">
<p>
Threat analysis, sometimes called "threat modeling" or "risk analysis," is a means of assessing risks or threats <sup><a id="fnr.113" class="footref" href="#fn.113">113</a></sup>. Through threat analysis, software can be designed to avoid the introduction of some vulnerabilities and reduce the severity of others. For instance, one form of threat analysis is documenting attack surfaces to understand how adversaries might use interfaces to elevate privilege. Without performing threat analysis, preferably at both the architectural and design levels, software can contain vulnerabilities that might otherwise be avoided <sup><a id="fnr.114" class="footref" href="#fn.114">114</a></sup>. Architectural threat analysis can significantly increase the security robustness and resilience of the architecture of software and its high-level designs to dramatically reduce the number and severity of vulnerabilities <sup><a id="fnr.115" class="footref" href="#fn.115">115</a></sup>.<br  />
</p>
</div></li></ul>
</div>
