dramatically_reducing_software_vulnerabilities/NIST.IR.8151.org
*** <<4.5>> 4.5 Table of Acronyms

| ACM    | Association for Computing Machinery                            |
| AI     | Artificial Intelligence                                        |
| API    | Application Program Interface                                  |
| ASLR   | Address Space Layout Randomization                             |
| AST    | Abstract Syntax Tree                                           |
| BLP    | Bell-LaPadula                                                  |
| BSIMM  | Building Security In Maturity Model                            |
| CAP    | Cybersecurity Assurance Program                                |
| CEGAR  | Counterexample-Guided Abstraction Refinement                   |
| CII    | Core Infrastructure Initiative                                 |
| CIL    | Common Intermediate Language                                   |
| CISQ   | Consortium for IT Software Quality                             |
| CMU    | Carnegie Mellon University                                     |
| CPU    | Central Processing Unit                                        |
| CWE    | Common Weakness Enumeration                                    |
| DARPA  | Defense Advanced Research Projects Agency                      |
| DHS    | Department of Homeland Security                                |
| DoD    | Department of Defense                                          |
| DSL    | Domain-Specific Language                                       |
| ESAPI  | Enterprise Security API                                        |
| FAA    | Federal Aviation Agency                                        |
| FSSCC  | Financial Services Sector Coordinating Council                 |
| GNU    | Gnu's Not Unix                                                 |
| GPU    | Graphics Processor Unit                                        |
| GUI    | Graphical User Interface                                       |
| ICT    | Information Communications Technology                          |
| IDE    | Integrated Development Environment                             |
| IEEE   | Institute of Electrical and Electronics Engineers              |
| iFACTS | Interim Future Area Control Tools Support                      |
| I/O    | Input/Output                                                   |
| IoC    | Inversion of Control                                           |
| IR     | Intermediate Representation                                    |
| ISO    | International Organization for Standardization                 |
| ITS    | Intrusion Tolerant Systems                                     |
| KDM    | Knowledge Discovery Metamodel                                  |
| LoC    | Lines of Code                                                  |
| ML     | MetaLangauge                                                   |
| MTD    | Moving Target Defense                                          |
| NaN    | Not a Number                                                   |
| NATS   | National Air Traffic Service                                   |
| NHTSA  | National Highway Traffic Safety Administration                 |
| NICE   | National Initiative for Cybersecurity Education                |
| NICTA  | National ICT Australia                                         |
| NIST   | National Institute of Standards and Technology                 |
| NITRD  | Networking and Information Technology Research and Development |
| OBDD   | Ordered Binary Decision Diagram                                |
| OS     | Operating System                                               |
| OSTP   | Office of Science and Technology Policy                        |
| OWASP  | Open Web Application Security Project                          |
| SAFES  | Software Assurance Findings Expression Schema                  |
| SAL    | Source code Annotation Language                                |
| SAT    | Boolean Satisfiability                                         |
| S2ERC  | Security and Software Engineering Research Center              |
| SI     | International System of Units                                  |
| SMT    | Satisfiability Modulo Theory                                   |
| SPSQ   | Software Productivity, Sustainability, and Quality             |
| SSCA   | Software and Supply Chain Assurance                            |
| S&T    | Science and Technology                                         |
| TCSEC  | Trusted Computer Security Evaluation Criteria                  |
| TOIF   | Tool Output Integration Framework                              |

