dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-org2eb1cf9" class="outline-4">
<h4 id="org2eb1cf9"><a id="orgcd07384"></a> 4.5 Table of Acronyms</h4>
<div class="outline-text-4" id="text-org2eb1cf9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">ACM</td>
<td class="org-left">Association for Computing Machinery</td>
</tr>

<tr>
<td class="org-left">AI</td>
<td class="org-left">Artificial Intelligence</td>
</tr>

<tr>
<td class="org-left">API</td>
<td class="org-left">Application Program Interface</td>
</tr>

<tr>
<td class="org-left">ASLR</td>
<td class="org-left">Address Space Layout Randomization</td>
</tr>

<tr>
<td class="org-left">AST</td>
<td class="org-left">Abstract Syntax Tree</td>
</tr>

<tr>
<td class="org-left">BLP</td>
<td class="org-left">Bell-LaPadula</td>
</tr>

<tr>
<td class="org-left">BSIMM</td>
<td class="org-left">Building Security In Maturity Model</td>
</tr>

<tr>
<td class="org-left">CAP</td>
<td class="org-left">Cybersecurity Assurance Program</td>
</tr>

<tr>
<td class="org-left">CEGAR</td>
<td class="org-left">Counterexample-Guided Abstraction Refinement</td>
</tr>

<tr>
<td class="org-left">CII</td>
<td class="org-left">Core Infrastructure Initiative</td>
</tr>

<tr>
<td class="org-left">CIL</td>
<td class="org-left">Common Intermediate Language</td>
</tr>

<tr>
<td class="org-left">CISQ</td>
<td class="org-left">Consortium for IT Software Quality</td>
</tr>

<tr>
<td class="org-left">CMU</td>
<td class="org-left">Carnegie Mellon University</td>
</tr>

<tr>
<td class="org-left">CPU</td>
<td class="org-left">Central Processing Unit</td>
</tr>

<tr>
<td class="org-left">CWE</td>
<td class="org-left">Common Weakness Enumeration</td>
</tr>

<tr>
<td class="org-left">DARPA</td>
<td class="org-left">Defense Advanced Research Projects Agency</td>
</tr>

<tr>
<td class="org-left">DHS</td>
<td class="org-left">Department of Homeland Security</td>
</tr>

<tr>
<td class="org-left">DoD</td>
<td class="org-left">Department of Defense</td>
</tr>

<tr>
<td class="org-left">DSL</td>
<td class="org-left">Domain-Specific Language</td>
</tr>

<tr>
<td class="org-left">ESAPI</td>
<td class="org-left">Enterprise Security API</td>
</tr>

<tr>
<td class="org-left">FAA</td>
<td class="org-left">Federal Aviation Agency</td>
</tr>

<tr>
<td class="org-left">FSSCC</td>
<td class="org-left">Financial Services Sector Coordinating Council</td>
</tr>

<tr>
<td class="org-left">GNU</td>
<td class="org-left">Gnu's Not Unix</td>
</tr>

<tr>
<td class="org-left">GPU</td>
<td class="org-left">Graphics Processor Unit</td>
</tr>

<tr>
<td class="org-left">GUI</td>
<td class="org-left">Graphical User Interface</td>
</tr>

<tr>
<td class="org-left">ICT</td>
<td class="org-left">Information Communications Technology</td>
</tr>

<tr>
<td class="org-left">IDE</td>
<td class="org-left">Integrated Development Environment</td>
</tr>

<tr>
<td class="org-left">IEEE</td>
<td class="org-left">Institute of Electrical and Electronics Engineers</td>
</tr>

<tr>
<td class="org-left">iFACTS</td>
<td class="org-left">Interim Future Area Control Tools Support</td>
</tr>

<tr>
<td class="org-left">I/O</td>
<td class="org-left">Input/Output</td>
</tr>

<tr>
<td class="org-left">IoC</td>
<td class="org-left">Inversion of Control</td>
</tr>

<tr>
<td class="org-left">IR</td>
<td class="org-left">Intermediate Representation</td>
</tr>

<tr>
<td class="org-left">ISO</td>
<td class="org-left">International Organization for Standardization</td>
</tr>

<tr>
<td class="org-left">ITS</td>
<td class="org-left">Intrusion Tolerant Systems</td>
</tr>

<tr>
<td class="org-left">KDM</td>
<td class="org-left">Knowledge Discovery Metamodel</td>
</tr>

<tr>
<td class="org-left">LoC</td>
<td class="org-left">Lines of Code</td>
</tr>

<tr>
<td class="org-left">ML</td>
<td class="org-left">MetaLangauge</td>
</tr>

<tr>
<td class="org-left">MTD</td>
<td class="org-left">Moving Target Defense</td>
</tr>

<tr>
<td class="org-left">NaN</td>
<td class="org-left">Not a Number</td>
</tr>

<tr>
<td class="org-left">NATS</td>
<td class="org-left">National Air Traffic Service</td>
</tr>

<tr>
<td class="org-left">NHTSA</td>
<td class="org-left">National Highway Traffic Safety Administration</td>
</tr>

<tr>
<td class="org-left">NICE</td>
<td class="org-left">National Initiative for Cybersecurity Education</td>
</tr>

<tr>
<td class="org-left">NICTA</td>
<td class="org-left">National ICT Australia</td>
</tr>

<tr>
<td class="org-left">NIST</td>
<td class="org-left">National Institute of Standards and Technology</td>
</tr>

<tr>
<td class="org-left">NITRD</td>
<td class="org-left">Networking and Information Technology Research and Development</td>
</tr>

<tr>
<td class="org-left">OBDD</td>
<td class="org-left">Ordered Binary Decision Diagram</td>
</tr>

<tr>
<td class="org-left">OS</td>
<td class="org-left">Operating System</td>
</tr>

<tr>
<td class="org-left">OSTP</td>
<td class="org-left">Office of Science and Technology Policy</td>
</tr>

<tr>
<td class="org-left">OWASP</td>
<td class="org-left">Open Web Application Security Project</td>
</tr>

<tr>
<td class="org-left">SAFES</td>
<td class="org-left">Software Assurance Findings Expression Schema</td>
</tr>

<tr>
<td class="org-left">SAL</td>
<td class="org-left">Source code Annotation Language</td>
</tr>

<tr>
<td class="org-left">SAT</td>
<td class="org-left">Boolean Satisfiability</td>
</tr>

<tr>
<td class="org-left">S2ERC</td>
<td class="org-left">Security and Software Engineering Research Center</td>
</tr>

<tr>
<td class="org-left">SI</td>
<td class="org-left">International System of Units</td>
</tr>

<tr>
<td class="org-left">SMT</td>
<td class="org-left">Satisfiability Modulo Theory</td>
</tr>

<tr>
<td class="org-left">SPSQ</td>
<td class="org-left">Software Productivity, Sustainability, and Quality</td>
</tr>

<tr>
<td class="org-left">SSCA</td>
<td class="org-left">Software and Supply Chain Assurance</td>
</tr>

<tr>
<td class="org-left">S&amp;T</td>
<td class="org-left">Science and Technology</td>
</tr>

<tr>
<td class="org-left">TCSEC</td>
<td class="org-left">Trusted Computer Security Evaluation Criteria</td>
</tr>

<tr>
<td class="org-left">TOIF</td>
<td class="org-left">Tool Output Integration Framework</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
