dramatically_reducing_software_vulnerabilities/NIST.IR.8151.org
** <<5>> 5 References

[fn:Anderson72] James P. Anderson, "Computer Security Technology Planning Study," Air Force ESD-TR-73-51, Vol. II, October 1972.

[fn:Armstrong14] Robert C. Armstrong, Ratish J. Punnoose, Matthew H. Wong and Jackson R. Mayo, "Survey of Existing Tools for Formal Verification," Sandia National Laboratories Report SAND2014-20533, December 2014. Available: http://prod.sandia.gov/techlib/access-control.cgi/2014/1420533.pdf Accessed 12 October 2016.

[fn:Bakker14] Paul Bakker, "Providing assurance and trust in PolarSSL," 8 May 2014, last modified 24 July 2015. Available: https://tls.mbed.org/tech-updates/blog/providing-assurance-and-trust-in-polarssl Accessed 21 June 2016.

[fn:Barnes06] Janet Barnes, Rod Chapman, Randy Johnson, James Widmaier, David Cooper and Bill Everett, "Engineering the Tokeneer Enclave Protection Software," Proc. 1st IEEE International Symposium on Secure Software Engineering (ISSSE), March 2006. Available: http://www.adacore.com/uploads/technical-papers/issse2006tokeneer_altran.pdf Accessed 12 October 2016.

[fn:Barnes13] John Barnes, "Safe and Secure Software: An Invitation to Ada 2012." Available: http://www.adacore.com/knowledge/technical-papers/safe-and-secure-software-an-invitation-to-ada-2012 Accessed 13 October 2016.

[fn:Barnett05] Mike Barnett, Bor-Yuh Evan Chang, Robert DeLine, Bart Jacobs and K. Rustan M. Leino, "Boogie: A Modular Reusable Verifier for Object-Oriented Programs," in Proc. 4th international conference on Formal Methods for Components and Objects (FMCO'05), Frank S. de Boer, Marcello M. Bonsangue, Susanne Graf and Willem-Paul de Roever, Eds. Springer, 2006, pp. 364-387, https://doi.org/10.1007/11804192_17.

[fn:Barnum12] Sean Barnum, "Software Assurance Findings Expression Schema (SAFES) Overview," January 2012. Available: https://www.mitre.org/publications/technical-papers/software-assurance-findings-expression-schema-safes-overview Accessed 8 September 2016.

[fn:Barritt16] Keith Barritt, "3 Lessons: FDA/FTC Enforcement Against Mobile Medical Apps," 14 January 2016. Available: http://www.meddeviceonline.com/doc/lessons-fda-ftc-enforcement-against-mobile-medical-apps-0001 Accessed 12 October 2016.

[fn:Beck94] Kent Beck, "Simple Smalltalk testing: with Patterns," The Smalltalk Report, 1994.

[fn:Beizer90] Boris Beizer, Software Testing Techniques, 2nd ed., Van Nostrand Reinhold Co., New York, NY, ISBN: 0-442-20672-0.

[fn:Bell76] D. E. Bell and L. J. La Padula, "Secure Computer System: Unified Exposition and Multics Interpretation," Electronics Systems Division, AFSC, Hanscom AF Base, Bedford MA, Technical Report No. ESD-TR-75-306, 1976.

[fn:Biba77] K. J. Biba, "Integrity Considerations for Secure Computer systems," Electronic Systems Division, AFSC, Hanscom AF Base, Bedford, MA, Technical Report ESD-TR-76-372, 1977. Available: http://www.dtic.mil/dtic/tr/fulltext/u2/a039324.pdf Accessed 12 October 2016.

[fn:Bjørner16] Nikolaj Bjørner, "SMT Solvers: Foundations and Applications," in Dependable Software Systems Engineering, Javier Esparza et. al., Eds. IOS Press, 2016, pp.24-32, https://doi.org/10.3233/978-1-61499-627-9-24.

[fn:Black11a] Paul E. Black, Michael Kass, Michael Koo and Elizabeth Fong, "Source Code Security Analysis Tool Functional Specification Version 1.1," NIST Special Publication (SP) 500-268 v1.1, February 2011, https://doi.org/10.6028/NIST.SP.500-268v1.1.

[fn:Black11b] Paul E. Black, "Counting Bugs is Harder Than You Think," in Proc. 11th IEEE International Working Conference on Source Code Analysis and Manipulation (SCAM 2011), Williamsburg, VA., 25-26 September 2011, pp. 1-9, https://doi.org/10.1109/SCAM.2011.24.

[fn:Black16] Paul E. Black and Elizabeth Fong, "Report of the Workshop on Software Measures and Metrics to Reduce Security Vulnerabilities (SwMM-RSV)," NIST Special Publication (SP) 500-320, October 2016, https://doi.org/10.6028/NIST.SP.500-320.

[fn:Boebert85] W. E. Boebert and R. Y. Kain, "A Practical Alternative to Hierarchical Integrity Policies," in Proc. 8th National Computer Security Conference, Gaithersburg, MD, 30 September-3 October 1985, pp.18-27. Available: http://csrc.nist.gov/publications/history/nissc/1985-8th-NCSC-proceedings.pdf Accessed 30 November 2016.

[fn:Böhme08] Rainer Böhme and Felix C. Freiling, "On Metrics and Measurements," in Irene Eusgeld, Felix Freiling and Ralf H. Reussner, Eds., in Dependability Metrics, Lecture Notes in Computer Science, Vol. 4909, Springer, 2008, pp. 7-13. https://doi.org/10.1007/978-3-540-68947-8_2.

[fn:Bojanova16] Irena Bojanova, Paul E. Black, Yaacov Yesha and Yan Wu, "The Bugs Framework (BF): A Structured Approach to Express Bugs," 2016 IEEE International Conference on Software Quality, Reliability, and Security (QRS 2016), Vienna, Austria, 1-3 August 2016, https://doi.org/10.1109/QRS.2016.29.

[fn:Boulanger15] Jean-Louis Boulanger, CENELEC 50128 and IEC 62279 Standards, John Wiley & Sons, 2015, https://doi.org/10.1002/9781119005056.

[fn:Brooks95] Frederick P. Brooks, Jr., The Mythical Man-Month: Essays on Software Engineering, Anniversary Edition, Addison-Wesley Professional, 1995, ISBN: 978-0201835953.

[fn:Busoli07] Simone Busoli, "Inversion of Control and Dependency Injection with Castle Windsor Container - Part I," 24 July 2007. Available: http://dotnetslackers.com/articles/designpatterns/InversionOfControlAndDependencyInjectionWi thCastleWindsorContainerPart1.aspx Accessed 29 September 2016.

[fn:Carter13] Kyle Carter, Adam Foltzer, Joe Hendrix, Brian Huffman and Aaron Tomb, "SAW: The Software Analysis Workbench," Proc. 2013 ACM SIGAda Annual Conference on High Integrity Language Technology (HILT '13), pp. 15-18, https://doi.org/10.1145/2527269.2527277.

[fn:Chapman14] Roderick Chapman and Florian Schanda, "Are We There Yet? 20 Years of Industrial Theorem Proving with SPARK," in Proc. Interactive Theorem Proving: 5th International Conference, ITP 2014, Held as Part of the Vienna Summer of Logic, VSL 2014, Vienna, Austria, July 14-17, 2014. Gerwin Klein and Ruben Gamboa, Eds., Lecture Notes in Computer Science, Vol. 8558, Springer, 2014, pp. 17-26, https://doi.org/10.1007/978-3-319-08970-6_2.

[fn:Chong05] Jennifer Chong, Partha Pal, Michael Atigetchi, Paul Rubel and Franklin Webber, "Survivability Architecture of a Mission Critical System: The DPASA Example," in Proc. 21st Annual Computer Security Applications Conference (ACSAC 2005), December 2005, pp. 495-504, https://doi.org/10.1109/CSAC.2005.54.

[fn:Claessen02] Koen Claessen and John Hughes, "Testing Monadic Programs with QuickCheck," SIGPLAN Notices. Vol. 37, Issue 12, 2002, pp. 47-59, https://doi.org/10.1145/636517.636527.

[fn:Clang] "clang: a C language family frontend for LLVM." Available: http://clang.llvm.org/ Accessed 13 October 2016.

[fn:CodeDx15] "Finding Software Vulnerabilities Before Hackers Do." Available: https://codedx.com/wp-content/uploads/2015/10/AppSec101-FromCodeDx.pdf Accessed 8 September 2016.

[fn:Corbato65] F. J. Corbató and V. A. Vyssotsky, "Introduction and Overview of the Multics System," 1965 Fall Joint Computer Conference. Available: http://multicians.org/fjcc1.html Accessed 13 October 2016.

[fn:Curtis16] Bill Curtis, private communication, 18 October 2016.

[fn:DARPA16] DARPA, "Cyber Grand Challenge." Available: https://www.cybergrandchallenge.com/ Accessed 21 October 2016.

[fn:Diamant11] John Diamant, "Resilient Security Architecture: A Complementary Approach to Re ducing Vulnerabilities," IEEE Security & Privacy, Vol. 9, Issue 4, July/August 2011, pp. 80-84, https://doi.org/10.1109/MSP.2011.88.

[fn:Docker16] "Docker." Available: https://www.docker.com/ Accessed 13 October 2016.

[fn:Doyle16] Richard Doyle, "Formal Methods, including Model-Based Verification and Correct-By-Construction," Dramatically Reducing Security Vulnerabilities sessions, Software and Supply Chain Assurance (SSCA) Working Group Summer 2016, McLean, Virginia, July 2016. Available: https://samate.nist.gov/docs/DRSV2016/SSCA_07_JPL_FormalMethods_Doyle.pdf Accessed 27 October 2016.

[fn:duBousquet04] L. du Bousquet, Y. Ledru, O. Maury, C. Oriat and J.-L. Lanet, "A case study in JML-based software validation," in Proc. 19th Int. IEEE Conf. on Automated Software Engineering (ASE'04), Linz, September 2004, pp. 294-297, https://doi.org/10.1109/ASE.2004.1342750.

[fn:ECMA13] "ECMA-335 Common Language Infrastructure (CLI)," 6th ed., June 2012. Available: http://www.ecma-international.org/publications/standards/Ecma-335.htm Accessed 20 October 2016.

[fn:FCRDSP16] Federal Cybersecurity Research and Development Strategic Plan, February 2016. Available: https://www.whitehouse.gov/sites/whitehouse.gov/files/documents/2016_Federal_Cybersecurity_Research_and_Development_Stratgeic_Plan.pdf Accessed 13 October 2016.

[fn:Fisher16] Kathleen Fisher, John Launchbury and Raymond Richards, "The HACMS Program: Using Formal Methods to Eliminate Exploitable Bugs," Philosophical Transactions of the Royal Society A, in submission as of October 2016. Presentation available: https://www.usenix.org/conference/usenixsecurity15/technical-sessions/presentation/fisher or slides available: https://www.usenix.org/sites/default/files/conference/protected-files/sec15_slides_fisher.pdf Accessed 25 October 2016.

[fn:Flater15] David Flater, "Defensive code's impact on software performance," NIST Technical Note 1860, January 2015, https://doi.org/10.6028/NIST.TN.1860.

[fn:Flater16] David Flater, Paul E. Black, Elizabeth Fong, Raghu Kacker, Vadim Okun, Stephen Wood and D. Richard Kuhn, "A Rational Foundation for Software Metrology," NIST Internal Report (IR) 8101, January 2016. https://doi.org/10.6028/NIST.IR.8101.

[fn:Fowler14] Martin Fowler, "Microservices: a definition of this new architectural term," 25 March 2014. Available: http://martinfowler.com/articles/microservices.html Accessed 13 October 2016.

[fn:FramaC] "What is Frama-C." Available: http://frama-c.com/what_is.html Accessed 13 October 2016.

[fn:Framework14] "Framework for Improving Critical Infrastructure Cybersecurity," Version 1.0, NIST, 12 February 2014. Available: https://www.nist.gov/document-3766 Accessed 7 November 2016.

[fn:Franz10] Michael Franz, "E unibus pluram: Massive-Scale Software Diversity as a Defense Mechanism," Proc. New Security Paradigms Workshop (NSPW '10), Concord, MA, 21-23 September 2010, pp. 7-16, https://doi.org/10.1145/1900546.1900550.

[fn:FTC16] Federal Trade Commission, "Mobile Health App Developers: FTC Best Practices," April 2016. Available: http://www.ftc.gov/tips-advice/business-center/guidance/mobile-health-app-developers-ftc-best-practices Accessed 13 October 2016.

[fn:Fundamental08] Fundamental Practices for Secure Software Development: A Guide to the Most Effective Secure Development Practices in Use Today, Stacy Simpson, Ed., 8 October 2008. Available: http://www.safecode.org/publication/SAFECode_Dev_Practices1108.pdf Accessed 7 November 2016.

[fn:Gabriel96] Richard P. Gabriel, Patterns of Software: Tales from the Software Community, Oxford Press, Oxford, 1996, ISBN: 0-19-5100269-X.

[fn:Gamma95] Erich Gamma, Richard Helm, Ralph Johnson and John Vlissides, Design Patterns: Elements of Reusable Object-Oriented Software, Addison-Wesley Professional, 1995, ISBN: 9788131700075.

[fn:GCC16] "GCC, the GNU Compiler Collection." Available: https://gcc.gnu.org/ Accessed 13 October 2016.

[fn:Goguen84] Joseph A. Goguen and Jose Meseguer, "Unwinding and Inference Control," in Proc. Symposium on Security and Privacy, IEEE, 1984, pp. 75-86, ISBN: 0818605324.

[fn:Grigg08] Ian Grigg, "The Market for Silver Bullets," 2 March 2008. Available: http://iang.org/papers/market_for_silver_bullets.html Accessed 28 October 2016.

[fn:Haigh15] Tom Haigh and Carl Landwehr, "Building Code for Medical Device Software Security," IEEE Cyber Security, 2015. Available: https://www.computer.org/cms/CYBSI/docs/BCMDSS.pdf Accessed 27 October 2016.

[fn:Heffley04] Jon Heffley and Pascal Meunier, "Can Source Code Auditing Software Identify Common Vulnerabilities and Be Used to Evaluate Software Security?" in Proc. 37th Annual Hawaii International Conference on System Sciences (HICSS-04), 5-8 January 2004, Track 9, Volume 9, IEEE Computer Society, 2004, pp. 1-10, https://doi.org/10.1109/HICSS.2004.1265654.

[fn:Hurd16] "GNU Hurd/hurd." Available: https://www.gnu.org/software/hurd/hurd.html Accessed 13 October 2016.

[fn:ISO15939] "ISO/IEC 15939:2007 Systems and software engineering - Measurement process," 2007.

[fn:ISO25010] "ISO/IEC 25010:2011 Systems and software engineering - Systems and software Quality Requirements and Evaluation (SQuaRE) - System and software quality models," 2011.

[fn:ISO25023] "ISO/IEC 25023:2016 Systems and software engineering - Systems and software Quality Requirements and Evaluation (SQuaRE) - Measurement of system and software product quality," 2016.

[fn:ISO25040] "ISO/IEC 25040:2011 Systems and software engineering - Systems and software Quality Requirements and Evaluation (SQuaRE) - Evaluation process," 2011.

[fn:ISO26262-6] "ISO 26262-6:2011 Road Vehicles - Functional safety - Part 6: Product development at the software level," 2011.

[fn:Iyer10] Vivek Iyer, Amit Kanitkar, Partha Dasgupta and Raghunathan Srinivasan, "Preventing Overflow Attacks by Memory Randomization," IEEE 21st International Symposium on Software Reliability Engineering (ISSRE), November 2010. https://doi.org/10.1109/ISSRE.2010.22.

[fn:Jézéquel97] Jean-Marc Jézéquel and Bertrand Meyer, "Design by Contract: The Lessons of Ariane," IEEE Computer, Vol. 30, Issue 1, January 1997, pp. 129-130, https://doi.org/10.1109/2.562936.

[fn:Kastrinis13] George Kastrinis and Yannis Smaragdakis, "Hybrid Context - Sensitivity for Points - To Analysis," Proc. 34th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI '13), 2013, pp. 423-434, https://doi.org/2499370.2462191.

[fn:KDM15] Object Management Group, "Knowledge Discovery Metamodel (KDM)." Available: http://www.omg.org/technology/kdm Accessed 8 September 2016.

[fn:Kiniry08] Joseph R. Kiniry and Daniel M. Zimmerman, "Secret Ninja Formal Methods," 15th International Symposium on Formal Methods (FM '08), Turku, Finland. May 2008. Available: http://verifiedgaming.org/publications_assets/KiniryZimmerman-FM08-SecretNinja.pdf Accessed 13 October 2016.

[fn:Klass16] Gregory Klass and Eric Burger, "Vendor Truth Serum," Georgetown University. Available: https://s2erc.georgetown.edu/projects/vendortruthserum Accessed 19 September 2016.

[fn:Klein14] Gerwin Klein, June Andronick, Kevin Elphinstone, Toby Murray, Thomas Sewell, Rafal Kolanski and Gernot Heiser, "Comprehensive Formal Verification of an OS Microkernel," ACM Transactions on Computer Systems, Vol. 32, Issue 1, February 2014, pp. 1-70, https://doi.org/10.1145/2560537.

[fn:Knight12] John Knight, "Helix: Self-regenerative Architecture for the Incorruptible Enterprise," Air Force Office of Scientific Research, AFRL-OSR-VA-TR-2012-1202, 13 November 2012. Available: http://www.dtic.mil/dtic/tr/fulltext/u2/a579086.pdf Accessed 20 October 2016.

[fn:Kuhn10] Richard Kuhn, Raghu Kacker and Yu Lei, "Practical Combinatorial Testing", NIST Special Publication (SP) 800-142, October 2010, https://doi.org/10.6028/NIST.SP.800-142.

[fn:Kuhn13] D. Richard Kuhn, Itzel Dominguez Mendoza, Raghu N. Kacker and Yu Lei, "Combinatorial Coverage Measurement Concepts and Applications," in 2013 IEEE Sixth International Conference on Software Testing, Verification and Validation Workshops (ICSTW 2013), pp. 352-361, https://doi.org/10.1109/ICSTW.2013.77.

[fn:Kuhn15] D. Richard Kuhn, Raghu N. Kacker and Yu Lei, "Measuring and specifying combinatorial coverage of test input configurations," Innovations in Systems and Software Engineering, Vol. 12, Issue 4, December 2016, pp. 249-261, https://doi.org/10.1007/s11334-015- 0266-2.

[fn:Lampson04] Butler W. Lampson, "Software Components: Only the Giants Survive," in Computer Systems: Theory, Technology, and Application, Karen I. B. Spaerck Jones and Andrew James Herbert, Eds., Springer, 2004, pp. 137-146, ISBN 978-0-387-20170-2. Available: http://research.microsoft.com/en-us/um/people/blampson/70-SoftwareComponents/70-SoftwareComponents.pdf Accessed 24 October 2016.

[fn:Landwehr15] Carl Landwehr, "We Need a Building Code for Building Code," Communications of the ACM, Vol. 58 No. 2, February 2015, pp. 24-26, https://doi.org/10.1145/2700341.

[fn:Lemon13] Lemon, "Getting Started with LXC on an Ubuntu 13.04 VPS," 6 August 2013. Available: https://www.digitalocean.com/community/tutorials/getting-started-with-lxc-on-an- ubuntu-13-04-vps Accessed 13 October 2016.

[fn:Leroy06] Xavier Leroy, "Formal certification of a compiler back-end or: programming a compiler with a proof assistant," Proc. 33rd ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL '06), pp. 42-54, https://doi.org/10.1145/1111037.1111042.

[fn:Lindholm15] Tim Lindholm, Frank Yellin, Gilad Bracha and Alex Buckley, "The Java® Virtual Machine Specification," Java SE 8 Edition, February 2015. Available: http://docs.oracle.com/javase/specs/jvms/se8/jvms8.pdf Accessed 20 October 2016.

[fn:LXC] "LXC," Ubuntu 16.04 Server Guide. Available: https://help.ubuntu.com/lts/serverguide/lxc.html Accessed 27 September 2016.

[fn:Marien16] John R. Marien, Chair, and Robert A. Martin, Co-chair, "Suggested Language to Incorporate Software Assurance Department of Defense Contracts," Department of Defense (DoD) Software Assurance (SwA) Community of Practice (CoP) Contract Language Working Group, February 2016. Available: http://www.acq.osd.mil/se/docs/2016-02-26-SwA-WorkingPapers.pdf Accessed 6 September 2016.

[fn:McConnell04] Steve McConnell, Code Complete, 2nd Ed., Microsoft Press, Redmond, WA, 2004, ISBN: 0735619670.

[fn:McIlroy68] M. D. McIlroy, "'Mass Produced' Software Components," in Software Engineering, 1968 NATO Conference on Software Engineering, Garmisch, Germany, 7-11 October 1968, pp. 138-150. Available: http://homepages.cs.ncl.ac.uk/brian.randell/NATO/nato1968.pdf Accessed 13 October 2016.

[fn:Mell11] Peter Mell and Timothy Grance, "The NIST Definition of Cloud Computing," NIST Special Publication (SP) 800-145, September 2011, https://doi.org/10.6028/NIST.SP.800-145.

[fn:Mills87] Harlan D. Mills, Michael Dyer and Richard C. Linger, "Cleanroom Software Engineering," IEEE Software, Vol. 4, Issue 5, 1987, pp. 19-25. Available: http://trace.tennessee.edu/utk_harlan/18/ Accessed 13 October 2016.

[fn:Oberg99] James Oberg, "Why the Mars probe went off course," IEEE Spectrum, Vol. 36, Issue 12, December 1999, pp. 34-39, https://doi.org/10.1109/6.809121.

[fn:Okhravi13] H. Okhravi, M. A. Rabe, T. J. Mayberry, W. G. Leonard, T. R. Hobson, D. Bigelow and W. W. Streilein, "Survey of Cyber Moving Targets," Massachusetts Institute of Technology Lincoln Laboratory. Technical Report 1166, 25 September 2013. Available: https://www.ll.mit.edu/mission/cybersec/publications/publication-files/full_papers/2013_09_23_OkhraviH_TR_FP.pdf Accessed 13 October 2016.

[fn:Okun04] Vadim Okun, Paul E. Black and Yaacov Yesha, "Comparison of Fault Classes in Specification-Based Testing," Information and Software Technology, Elsevier, Vol. 46, Issue 8, June 2004, pp. 525-533, https://doi.org/10.1016/j.infsof.2003.10.003.

[fn:Okun08] Vadim Okun, Romain Gaucher and Paul E. Black, Eds., "Static Analysis Tool
Exposition (SATE) 2008," NIST Special Publication (SP) 500-279, June 2009, https://doi.org/10.6028/NIST.SP.500-279.

[fn:OMG16] Object Management Group, "Automated Source Code Maintainability Measure\x{2122} (ASCMM\x{2122}) V1.0," January 2016. Available: http://www.omg.org/spec/ASCMM/1.0 Accessed 12 October 2016.

[fn:Ourghanlian14] Alain Ourghanlian, "Evaluation of static analysis tools used to assess software important to nuclear power plant safety," Nuclear Engineering and Technology: Special Issue on ISOFIC/ISSNP2014, Vol. 47, Issue 2, March 2015, pp. 212-218, https://doi.org/10.1016/j.net.2014.12.009.

[fn:PaX01] "Design and Implementation of Address Space Layout randomization," https://pax.grsecurity.net/docs/aslr.txt, cited in "Address space layout randomization," Wikipedia. Available: https://en.wikipedia.org/wiki/Address_space_layout_randomization Accessed 15 September 2016.

[fn:Perini16] Barti Perini, Stephen Shook and Girish Seshagiri, "Reducing Software Vulnerabilities - The Number One Goal for Every Software Development Organization, Team, and Individual," ISHIPI Technical Report, 22 July 2016.

[fn:Pirsig74] Robert M. Pirsig, Zen and the Art of Motorcycle Maintenance: An Inquiry into Values, William Morrow & Company, New York 1974, ISBN: 9780688002305.

[fn:Plan16] National Initiative for Cybersecurity Education (NICE), "Strategic Plan," April 2016. Available: http://csrc.nist.gov/nice/about/strategicplan.html Accessed 20 October 2016.

[fn:Randimbivololona99] Famantanantsoa Randimbivololona, Jean Souyris, Patrick Baudin, Anne Pacalet, Jacques Raguideau and Dominique Schoen, "Applying Formal Proof Techniques to Avionics Software: A Pragmatic Approach," FM '99 - Formal Methods: Proc. World Congress on Formal Methods in the Development of Computing Systems Toulouse, France, September 20- 24, 1999, Volume II, Jeannette M. Wing, Jim Woodcock and Jim Davies, Eds., Lecture Notes in Computer Science, Springer, Vol. 1709, 1999, pp. 1798-1815, https://doi.org/10.1007/3-540-48118-4.

[fn:Rashid86] R. Rashid, "Threads of a New System," Unix Review, Vol. 4, No. 8, August 1986, pp. 37-49.

[fn:Regehr15] John Regehr, "Comments on a Formal Verification of PolarSSL," 2015. Available: http://blog.regehr.org/archives/1261 Accessed 21 June 2016.

[fn:Rice08] David Rice, Geekonomics: The Real Cost of Insecure Software, Addison-Wesley, 2008, ISBN: 978-0321477897.

[fn:Rose16] "ROSE compiler infrastructure." Available: http://rosecompiler.org/ Accessed 8 September 2016.

[fn:Rowe12] Jeff Rowe, Karl N. Levitt, Tufan Demir, Robert Erbacher, "Artificial Diversity as Maneuvers in a Control Theoretic Moving Target Defense," Proc. National Moving Target Research Symposium, Annapolis, MD, June 2012.

[fn:Rushby05] John Rushby, "An Evidential Tool Bus," in Proc. 7th international conference on Formal Methods and Software Engineering (ICFEM'05), Springer, 2005, p. 36, https://doi.org/10.1007/11576280_3.

[fn:Saltzer75] Jerome H. Saltzer and Michael D. Shroeder, "The Protection of Information in Computer systems," Proc. IEEE Vol. 63, Issue 9, September 1975, pp. 1278-1308, https://doi.org/10.1109/PROC.1975.9939.

[fn:Shostack14] Adam Shostack, Threat Modeling: Designing for Security, Wiley and Sons, 2014, ISBN: 978-1-118-80999-0.

[fn:SMTLIB15] "SMT-LIB: The Satisfiability Modulo Theories Library," 1 June 2015. Available: http://smtlib.cs.uiowa.edu Accessed 13 October 2016.

[fn:Software16] "Software framework." Available: https://en.wikipedia.org/wiki/Software_framework Accessed 13 October 2016.

[fn:Song08] Dawn Song, David Brumley, Heng Yin, Juan Caballero, Ivan Jager, Min Gyung Kang, Zhenkai Liang, James Newsome, Pongsin Poosankam and Prateek Saxena, "BitBlaze: A New Approach to Computer Security via Binary Analysis," Proc. 4th International Conference on Information Systems Security (ICISS 2008), Hyderbad, India, 16-20 December 2008, R. Sekar and Arun K. Pujari, Eds., Lecture Notes in Computer Science, Springer, Vol. 5352, 2008, pp. 1- 25, ISBN 978-3-540-89862-7.

[fn:Souyris09] Jean Souyris, Virginie Wiels, David Delmas and Hervé Delseny, "Formal Verification of Avionics Software Products," Proc. FM 2009: Formal Methods: Second World Congress, Eindhoven, The Netherlands, November 2-6, 2009, Ana Cavalcanti and Dennis R. Dams, Eds., Lecture Notes in Computer Science, Springer, Vol. 5850, 2009, pp. 532-546, https://doi.org/10.1007/978-3-642-05089-3_34.

[fn:Tschannen11] Julian Tschannen, Carlo A. Furia, Martin Nordio and Bertrand Meyer, "Verifying Eiffel Programs with Boogie," BOOGIE 2011: First International Workshop on Intermediate Verification Languages, 2011. Available: https://arxiv.org/abs/1106.4700 Accessed 13 October 2016.

[fn:TodoMVC16] "TodoMVC: Helping you select an MV* framework." Available: http://todomvc.com/ Accessed 13 October 2016.

[fn:Tolerant07] "Tolerant Systems." Available: http://www.tolerantsystems.org/ Accessed 13 October 2016.

[fn:VCC13] VCC verifier. Available: https://vcc.codeplex.com/ Accessed 13 October 2016.

[fn:Voas16a] Jeffrey Voas and Kim Schaffer, "Insights on Formal Methods in Cybersecurity," IEEE Computer, Vol. 49, Issue 5, May 2016, pp. 102-105, https://doi.org/10.1109/MC.2016.131.

[fn:Voas16b] Jeffrey Voas and Kim Schaffer, "What Happened to Formal Methods for Security?", IEEE Computer, Vol. 49, Issue 8, August 2016, pp. 70-79, https://doi.org/10.1109/MC.2016.228.

[fn:Wayner15] Peter Wayner, "7 reasons why frameworks are the new programming languages," 30 March 2015. Available: http://www.infoworld.com/article/2902242/application-development/7-reasons-why-frameworks-are-the-new-programming-languages.html Accessed 13 October 2016.

[fn:What] "What's LXC?", Available: https://linuxcontainers.org/lxc/introduction Accessed 13 October 2016.

[fn:Whaley05] John Whaley, Dzintars Avots, Michael Carbin and Monica S. Lam, "Using Datalog with Binary Decision Diagrams for Program Analysis," 3rd Asian Symposium on Programming Languages and Systems (ASPLAS), Tsukuba, Japan, 3-5 November 2005.

[fn:Williams16] Chris Williams, "How one developer just broke Node, Babel and thousands of projects in 11 lines of JavaScript," 23 March 2016. Available: http://www.theregister.co.uk/2016/03/23/npm_left_pad_chaos Accessed 13 October 2016.

[fn:Woodcock09] Jim Woodcock, Peter Gorm Larsen, Juan Bicarregui and John Fitzgerald, "Formal Methods: Practice and Experience," ACM Computing Surveys, Vol. 41, Issue 4, October 2009, pp. 1-36, https://doi.org/10.1145/1592434.1592436.

[fn:Woodcock10] Jim Woodcock, Emine Gökçe Aydal and Rod Chapman, "The Tokeneer Experiments," in Reflections on the Work of C.A.R. Hoare, Cliff Jones, A. W. Roscoe and Kenneth R. Wood, Eds., July 2010, Chapter 17, pp. 405-430, https://doi.org/10.1007/978-1-84882-912-1_17.

[fn:Woody14] Carol Woody, Robert Ellison and William Nichols, "Predicting Software Assurance Using Quality and Reliability Measures," Technical Note CMU/SEI-2014-TN-026, December 2014. Available: http://resources.sei.cmu.edu/asset_files/technicalnote/2014_004_001_428597.pdf Accessed 13 October 2016.

[fn:Woody16] Carol Woody, private communication, 17 October 2016.

[fn:WSA04] "Web Services Architecture," 11 February 2004. Available: https://www.w3.org/2002/ws/arch/ Accessed 27 October 2016.

[fn:Wu11] Yan Wu, H Siy and Robin Gandhi, "Empirical results on the study of software vulnerabilities (NIER track)," in Proc. 33rd International Conference on Software Engineering (ICSE '11), Honolulu, Hawaii, 21-28 May 2011, pp. 964-967, https://doi.org/10.1145/1985793.1985960.

[fn:Yang10] Jean Yang and Chris Hawblitzel, "Safe to the last instruction: automated verification of a type-safe operating system," in Proc. 31st ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI), 2010, pp. 99-110, https://doi.org/10.1145/1806596.1806610.

[fn:Zhu97] Hong Zhu, Patrick A. V. Hall and John H. R. May, "Software unit test coverage and adequacy," ACM Computing Surveys, Vol. 29, Issue 4, December 1997, pp. 366-427, https://doi.org/10.1145/267580.267590.
