dramatically_reducing_software_vulnerabilities/NIST.IR.8151.html

<div id="outline-container-orgb4a06e0" class="outline-3">
<h3 id="orgb4a06e0"><a id="org1b7e672"></a> 5 References</h3>
<div class="outline-text-3" id="text-orgb4a06e0">
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Federal Cybersecurity Research and Development Strategic Plan, February 2016. Available: <a href="https://www.whitehouse.gov/sites/whitehouse.gov/files/documents/2016_Federal_Cybersecurity_Research_and_Development_Stratgeic_Plan.pdf">https://www.whitehouse.gov/sites/whitehouse.gov/files/documents/2016_Federal_Cybersecurity_Research_and_Development_Stratgeic_Plan.pdf</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Paul E. Black, Michael Kass, Michael Koo and Elizabeth Fong, "Source Code Security Analysis Tool Functional Specification Version 1.1," NIST Special Publication (SP) 500-268 v1.1, February 2011, <a href="https://doi.org/10.6028/NIST.SP.500-268v1.1">https://doi.org/10.6028/NIST.SP.500-268v1.1</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
James Oberg, "Why the Mars probe went off course," IEEE Spectrum, Vol. 36, Issue 12, December 1999, pp. 34-39, <a href="https://doi.org/10.1109/6.809121">https://doi.org/10.1109/6.809121</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
Steve McConnell, Code Complete, 2nd Ed., Microsoft Press, Redmond, WA, 2004, ISBN: 0735619670.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
Jon Heffley and Pascal Meunier, "Can Source Code Auditing Software Identify Common Vulnerabilities and Be Used to Evaluate Software Security?" in Proc. 37th Annual Hawaii International Conference on System Sciences (HICSS-04), 5-8 January 2004, Track 9, Volume 9, IEEE Computer Society, 2004, pp. 1-10, <a href="https://doi.org/10.1109/HICSS.2004.1265654">https://doi.org/10.1109/HICSS.2004.1265654</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
Ian Grigg, "The Market for Silver Bullets," 2 March 2008. Available: <a href="http://iang.org/papers/market_for_silver_bullets.html">http://iang.org/papers/market_for_silver_bullets.html</a> Accessed 28 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
Nikolaj Bjørner, "SMT Solvers: Foundations and Applications," in Dependable Software Systems Engineering, Javier Esparza et. al., Eds. IOS Press, 2016, pp.24-32, <a href="https://doi.org/10.3233/978-1-61499-627-9-24">https://doi.org/10.3233/978-1-61499-627-9-24</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
Joseph R. Kiniry and Daniel M. Zimmerman, "Secret Ninja Formal Methods," 15th International Symposium on Formal Methods (FM '08), Turku, Finland. May 2008. Available: <a href="http://verifiedgaming.org/publications_assets/KiniryZimmerman-FM08-SecretNinja.pdf">http://verifiedgaming.org/publications_assets/KiniryZimmerman-FM08-SecretNinja.pdf</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
"ISO 26262-6:2011 Road Vehicles - Functional safety - Part 6: Product development at the software level," 2011.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10">10</a></sup> <div class="footpara"><p class="footpara">
Jean-Louis Boulanger, CENELEC 50128 and IEC 62279 Standards, John Wiley &amp; Sons, 2015, <a href="https://doi.org/10.1002/9781119005056">https://doi.org/10.1002/9781119005056</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11">11</a></sup> <div class="footpara"><p class="footpara">
Famantanantsoa Randimbivololona, Jean Souyris, Patrick Baudin, Anne Pacalet, Jacques Raguideau and Dominique Schoen, "Applying Formal Proof Techniques to Avionics Software: A Pragmatic Approach," FM '99 - Formal Methods: Proc. World Congress on Formal Methods in the Development of Computing Systems Toulouse, France, September 20- 24, 1999, Volume II, Jeannette M. Wing, Jim Woodcock and Jim Davies, Eds., Lecture Notes in Computer Science, Springer, Vol. 1709, 1999, pp. 1798-1815, <a href="https://doi.org/10.1007/3-540-48118-4">https://doi.org/10.1007/3-540-48118-4</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12">12</a></sup> <div class="footpara"><p class="footpara">
Kyle Carter, Adam Foltzer, Joe Hendrix, Brian Huffman and Aaron Tomb, "SAW: The Software Analysis Workbench," Proc. 2013 ACM SIGAda Annual Conference on High Integrity Language Technology (HILT '13), pp. 15-18, <a href="https://doi.org/10.1145/2527269.2527277">https://doi.org/10.1145/2527269.2527277</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.13" class="footnum" href="#fnr.13">13</a></sup> <div class="footpara"><p class="footpara">
Richard Doyle, "Formal Methods, including Model-Based Verification and Correct-By-Construction," Dramatically Reducing Security Vulnerabilities sessions, Software and Supply Chain Assurance (SSCA) Working Group Summer 2016, McLean, Virginia, July 2016. Available: <a href="https://samate.nist.gov/docs/DRSV2016/SSCA_07_JPL_FormalMethods_Doyle.pdf">https://samate.nist.gov/docs/DRSV2016/SSCA_07_JPL_FormalMethods_Doyle.pdf</a> Accessed 27 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.14" class="footnum" href="#fnr.14">14</a></sup> <div class="footpara"><p class="footpara">
Janet Barnes, Rod Chapman, Randy Johnson, James Widmaier, David Cooper and Bill Everett, "Engineering the Tokeneer Enclave Protection Software," Proc. 1st IEEE International Symposium on Secure Software Engineering (ISSSE), March 2006. Available: <a href="http://www.adacore.com/uploads/technical-papers/issse2006tokeneer_altran.pdf">http://www.adacore.com/uploads/technical-papers/issse2006tokeneer_altran.pdf</a> Accessed 12 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.15" class="footnum" href="#fnr.15">15</a></sup> <div class="footpara"><p class="footpara">
Jim Woodcock, Emine Gökçe Aydal and Rod Chapman, "The Tokeneer Experiments," in Reflections on the Work of C.A.R. Hoare, Cliff Jones, A. W. Roscoe and Kenneth R. Wood, Eds., July 2010, Chapter 17, pp. 405-430, <a href="https://doi.org/10.1007/978-1-84882-912-1_17">https://doi.org/10.1007/978-1-84882-912-1_17</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.16" class="footnum" href="#fnr.16">16</a></sup> <div class="footpara"><p class="footpara">
Paul Bakker, "Providing assurance and trust in PolarSSL," 8 May 2014, last modified 24 July 2015. Available: <a href="https://tls.mbed.org/tech-updates/blog/providing-assurance-and-trust-in-polarssl">https://tls.mbed.org/tech-updates/blog/providing-assurance-and-trust-in-polarssl</a> Accessed 21 June 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.17" class="footnum" href="#fnr.17">17</a></sup> <div class="footpara"><p class="footpara">
John Regehr, "Comments on a Formal Verification of PolarSSL," 2015. Available: <a href="http://blog.regehr.org/archives/1261">http://blog.regehr.org/archives/1261</a> Accessed 21 June 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.18" class="footnum" href="#fnr.18">18</a></sup> <div class="footpara"><p class="footpara">
Alain Ourghanlian, "Evaluation of static analysis tools used to assess software important to nuclear power plant safety," Nuclear Engineering and Technology: Special Issue on ISOFIC/ISSNP2014, Vol. 47, Issue 2, March 2015, pp. 212-218, <a href="https://doi.org/10.1016/j.net.2014.12.009">https://doi.org/10.1016/j.net.2014.12.009</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.19" class="footnum" href="#fnr.19">19</a></sup> <div class="footpara"><p class="footpara">
Jeffrey Voas and Kim Schaffer, "What Happened to Formal Methods for Security?", IEEE Computer, Vol. 49, Issue 8, August 2016, pp. 70-79, <a href="https://doi.org/10.1109/MC.2016.228">https://doi.org/10.1109/MC.2016.228</a>. A follow-up roundtable about formal methods with those seven experts.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.20" class="footnum" href="#fnr.20">20</a></sup> <div class="footpara"><p class="footpara">
L. du Bousquet, Y. Ledru, O. Maury, C. Oriat and J.-L. Lanet, "A case study in JML-based software validation," in Proc. 19th Int. IEEE Conf. on Automated Software Engineering (ASE'04), Linz, September 2004, pp. 294-297, <a href="https://doi.org/10.1109/ASE.2004.1342750">https://doi.org/10.1109/ASE.2004.1342750</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.21" class="footnum" href="#fnr.21">21</a></sup> <div class="footpara"><p class="footpara">
Jean-Marc Jézéquel and Bertrand Meyer, "Design by Contract: The Lessons of Ariane," IEEE Computer, Vol. 30, Issue 1, January 1997, pp. 129-130, <a href="https://doi.org/10.1109/2.562936">https://doi.org/10.1109/2.562936</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.22" class="footnum" href="#fnr.22">22</a></sup> <div class="footpara"><p class="footpara">
Gregory Klass and Eric Burger, "Vendor Truth Serum," Georgetown University. Available: <a href="https://s2erc.georgetown.edu/projects/vendortruthserum">https://s2erc.georgetown.edu/projects/vendortruthserum</a> Accessed 19 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.23" class="footnum" href="#fnr.23">23</a></sup> <div class="footpara"><p class="footpara">
Kathleen Fisher, John Launchbury and Raymond Richards, "The HACMS Program: Using Formal Methods to Eliminate Exploitable Bugs," Philosophical Transactions of the Royal Society A, in submission as of October 2016. Presentation available: <a href="https://www.usenix.org/conference/usenixsecurity15/technical-sessions/presentation/fisher">https://www.usenix.org/conference/usenixsecurity15/technical-sessions/presentation/fisher</a> or slides available: <a href="https://www.usenix.org/sites/default/files/conference/protected-files/sec15_slides_fisher.pdf">https://www.usenix.org/sites/default/files/conference/protected-files/sec15_slides_fisher.pdf</a> Accessed 25 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.24" class="footnum" href="#fnr.24">24</a></sup> <div class="footpara"><p class="footpara">
Xavier Leroy, "Formal certification of a compiler back-end or: programming a compiler with a proof assistant," Proc. 33rd ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL '06), pp. 42-54, <a href="https://doi.org/10.1145/1111037.1111042">https://doi.org/10.1145/1111037.1111042</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.25" class="footnum" href="#fnr.25">25</a></sup> <div class="footpara"><p class="footpara">
Irena Bojanova, Paul E. Black, Yaacov Yesha and Yan Wu, "The Bugs Framework (BF): A Structured Approach to Express Bugs," 2016 IEEE International Conference on Software Quality, Reliability, and Security (QRS 2016), Vienna, Austria, 1-3 August 2016, <a href="https://doi.org/10.1109/QRS.2016.29">https://doi.org/10.1109/QRS.2016.29</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.26" class="footnum" href="#fnr.26">26</a></sup> <div class="footpara"><p class="footpara">
David Flater, "Defensive code's impact on software performance," NIST Technical Note 1860, January 2015, <a href="https://doi.org/10.6028/NIST.TN.1860">https://doi.org/10.6028/NIST.TN.1860</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.27" class="footnum" href="#fnr.27">27</a></sup> <div class="footpara"><p class="footpara">
Gerwin Klein, June Andronick, Kevin Elphinstone, Toby Murray, Thomas Sewell, Rafal Kolanski and Gernot Heiser, "Comprehensive Formal Verification of an OS Microkernel," ACM Transactions on Computer Systems, Vol. 32, Issue 1, February 2014, pp. 1-70, <a href="https://doi.org/10.1145/2560537">https://doi.org/10.1145/2560537</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.28" class="footnum" href="#fnr.28">28</a></sup> <div class="footpara"><p class="footpara">
Roderick Chapman and Florian Schanda, "Are We There Yet? 20 Years of Industrial Theorem Proving with SPARK," in Proc. Interactive Theorem Proving: 5th International Conference, ITP 2014, Held as Part of the Vienna Summer of Logic, VSL 2014, Vienna, Austria, July 14-17, 2014. Gerwin Klein and Ruben Gamboa, Eds., Lecture Notes in Computer Science, Vol. 8558, Springer, 2014, pp. 17-26, <a href="https://doi.org/10.1007/978-3-319-08970-6_2">https://doi.org/10.1007/978-3-319-08970-6_2</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.29" class="footnum" href="#fnr.29">29</a></sup> <div class="footpara"><p class="footpara">
Jean Souyris, Virginie Wiels, David Delmas and Hervé Delseny, "Formal Verification of Avionics Software Products," Proc. FM 2009: Formal Methods: Second World Congress, Eindhoven, The Netherlands, November 2-6, 2009, Ana Cavalcanti and Dennis R. Dams, Eds., Lecture Notes in Computer Science, Springer, Vol. 5850, 2009, pp. 532-546, <a href="https://doi.org/10.1007/978-3-642-05089-3_34">https://doi.org/10.1007/978-3-642-05089-3_34</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.30" class="footnum" href="#fnr.30">30</a></sup> <div class="footpara"><p class="footpara">
Jim Woodcock, Peter Gorm Larsen, Juan Bicarregui and John Fitzgerald, "Formal Methods: Practice and Experience," ACM Computing Surveys, Vol. 41, Issue 4, October 2009, pp. 1-36, <a href="https://doi.org/10.1145/1592434.1592436">https://doi.org/10.1145/1592434.1592436</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.31" class="footnum" href="#fnr.31">31</a></sup> <div class="footpara"><p class="footpara">
Carol Woody, Robert Ellison and William Nichols, "Predicting Software Assurance Using Quality and Reliability Measures," Technical Note CMU/SEI-2014-TN-026, December 2014. Available: <a href="http://resources.sei.cmu.edu/asset_files/technicalnote/2014_004_001_428597.pdf">http://resources.sei.cmu.edu/asset_files/technicalnote/2014_004_001_428597.pdf</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.32" class="footnum" href="#fnr.32">32</a></sup> <div class="footpara"><p class="footpara">
F. J. Corbató and V. A. Vyssotsky, "Introduction and Overview of the Multics System," 1965 Fall Joint Computer Conference. Available: <a href="http://multicians.org/fjcc1.html">http://multicians.org/fjcc1.html</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.33" class="footnum" href="#fnr.33">33</a></sup> <div class="footpara"><p class="footpara">
D. E. Bell and L. J. La Padula, "Secure Computer System: Unified Exposition and Multics Interpretation," Electronics Systems Division, AFSC, Hanscom AF Base, Bedford MA, Technical Report No. ESD-TR-75-306, 1976.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.34" class="footnum" href="#fnr.34">34</a></sup> <div class="footpara"><p class="footpara">
Joseph A. Goguen and Jose Meseguer, "Unwinding and Inference Control," in Proc. Symposium on Security and Privacy, IEEE, 1984, pp. 75-86, ISBN: 0818605324.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.35" class="footnum" href="#fnr.35">35</a></sup> <div class="footpara"><p class="footpara">
K. J. Biba, "Integrity Considerations for Secure Computer systems," Electronic Systems Division, AFSC, Hanscom AF Base, Bedford, MA, Technical Report ESD-TR-76-372, 1977. Available: <a href="http://www.dtic.mil/dtic/tr/fulltext/u2/a039324.pdf">http://www.dtic.mil/dtic/tr/fulltext/u2/a039324.pdf</a> Accessed 12 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.36" class="footnum" href="#fnr.36">36</a></sup> <div class="footpara"><p class="footpara">
W. E. Boebert and R. Y. Kain, "A Practical Alternative to Hierarchical Integrity Policies," in Proc. 8th National Computer Security Conference, Gaithersburg, MD, 30 September-3 October 1985, pp.18-27. Available: <a href="http://csrc.nist.gov/publications/history/nissc/1985-8th-NCSC-proceedings.pdf">http://csrc.nist.gov/publications/history/nissc/1985-8th-NCSC-proceedings.pdf</a> Accessed 30 November 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.37" class="footnum" href="#fnr.37">37</a></sup> <div class="footpara"><p class="footpara">
"Tolerant Systems." Available: <a href="http://www.tolerantsystems.org/">http://www.tolerantsystems.org/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.38" class="footnum" href="#fnr.38">38</a></sup> <div class="footpara"><p class="footpara">
Jennifer Chong, Partha Pal, Michael Atigetchi, Paul Rubel and Franklin Webber, "Survivability Architecture of a Mission Critical System: The DPASA Example," in Proc. 21st Annual Computer Security Applications Conference (ACSAC 2005), December 2005, pp. 495-504, <a href="https://doi.org/10.1109/CSAC.2005.54">https://doi.org/10.1109/CSAC.2005.54</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.39" class="footnum" href="#fnr.39">39</a></sup> <div class="footpara"><p class="footpara">
"LXC," Ubuntu 16.04 Server Guide. Available: <a href="https://help.ubuntu.com/lts/serverguide/lxc.html">https://help.ubuntu.com/lts/serverguide/lxc.html</a> Accessed 27 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.40" class="footnum" href="#fnr.40">40</a></sup> <div class="footpara"><p class="footpara">
"Docker." Available: <a href="https://www.docker.com/">https://www.docker.com/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.41" class="footnum" href="#fnr.41">41</a></sup> <div class="footpara"><p class="footpara">
Jerome H. Saltzer and Michael D. Shroeder, "The Protection of Information in Computer systems," Proc. IEEE Vol. 63, Issue 9, September 1975, pp. 1278-1308, <a href="https://doi.org/10.1109/PROC.1975.9939">https://doi.org/10.1109/PROC.1975.9939</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.42" class="footnum" href="#fnr.42">42</a></sup> <div class="footpara"><p class="footpara">
Martin Fowler, "Microservices: a definition of this new architectural term," 25 March 2014. Available: <a href="http://martinfowler.com/articles/microservices.html">http://martinfowler.com/articles/microservices.html</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.43" class="footnum" href="#fnr.43">43</a></sup> <div class="footpara"><p class="footpara">
R. Rashid, "Threads of a New System," Unix Review, Vol. 4, No. 8, August 1986, pp. 37-49.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.44" class="footnum" href="#fnr.44">44</a></sup> <div class="footpara"><p class="footpara">
"GNU Hurd/hurd." Available: <a href="https://www.gnu.org/software/hurd/hurd.html">https://www.gnu.org/software/hurd/hurd.html</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.45" class="footnum" href="#fnr.45">45</a></sup> <div class="footpara"><p class="footpara">
"Web Services Architecture," 11 February 2004. Available: <a href="https://www.w3.org/2002/ws/arch/">https://www.w3.org/2002/ws/arch/</a> Accessed 27 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.46" class="footnum" href="#fnr.46">46</a></sup> <div class="footpara"><p class="footpara">
James P. Anderson, "Computer Security Technology Planning Study," Air Force ESD-TR-73-51, Vol. II, October 1972.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.47" class="footnum" href="#fnr.47">47</a></sup> <div class="footpara">Operating system containers are useful implementing mechanisms for some clouds, but cloud computing is distinct from operating system containers <sup><a id="fnr.48" class="footref" href="#fn.48">48</a></sup>.</div></div>

<div class="footdef"><sup><a id="fn.48" class="footnum" href="#fnr.48">48</a></sup> <div class="footpara"><p class="footpara">
Peter Mell and Timothy Grance, "The NIST Definition of Cloud Computing," NIST Special Publication (SP) 800-145, September 2011, <a href="https://doi.org/10.6028/NIST.SP.800-145">https://doi.org/10.6028/NIST.SP.800-145</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.49" class="footnum" href="#fnr.49">49</a></sup> <div class="footpara"><p class="footpara">
"ROSE compiler infrastructure." Available: <a href="http://rosecompiler.org/">http://rosecompiler.org/</a> Accessed 8 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.50" class="footnum" href="#fnr.50">50</a></sup> <div class="footpara"><p class="footpara">
Object Management Group, "Knowledge Discovery Metamodel (KDM)." Available: <a href="http://www.omg.org/technology/kdm">http://www.omg.org/technology/kdm</a> Accessed 8 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.51" class="footnum" href="#fnr.51">51</a></sup> <div class="footpara"><p class="footpara">
"GCC, the GNU Compiler Collection." Available: <a href="https://gcc.gnu.org/">https://gcc.gnu.org/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.52" class="footnum" href="#fnr.52">52</a></sup> <div class="footpara"><p class="footpara">
"clang: a C language family frontend for LLVM." Available: <a href="http://clang.llvm.org/">http://clang.llvm.org/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.53" class="footnum" href="#fnr.53">53</a></sup> <div class="footpara"><p class="footpara">
"What is Frama-C." Available: <a href="http://frama-c.com/what_is.html">http://frama-c.com/what_is.html</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.54" class="footnum" href="#fnr.54">54</a></sup> <div class="footpara"><p class="footpara">
"ECMA-335 Common Language Infrastructure (CLI)," 6th ed., June 2012. Available: <a href="http://www.ecma-international.org/publications/standards/Ecma-335.htm">http://www.ecma-international.org/publications/standards/Ecma-335.htm</a> Accessed 20 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.55" class="footnum" href="#fnr.55">55</a></sup> <div class="footpara"><p class="footpara">
Tim Lindholm, Frank Yellin, Gilad Bracha and Alex Buckley, "The Java® Virtual Machine Specification," Java SE 8 Edition, February 2015. Available: <a href="http://docs.oracle.com/javase/specs/jvms/se8/jvms8.pdf">http://docs.oracle.com/javase/specs/jvms/se8/jvms8.pdf</a> Accessed 20 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.56" class="footnum" href="#fnr.56">56</a></sup> <div class="footpara"><p class="footpara">
Dawn Song, David Brumley, Heng Yin, Juan Caballero, Ivan Jager, Min Gyung Kang, Zhenkai Liang, James Newsome, Pongsin Poosankam and Prateek Saxena, "BitBlaze: A New Approach to Computer Security via Binary Analysis," Proc. 4th International Conference on Information Systems Security (ICISS 2008), Hyderbad, India, 16-20 December 2008, R. Sekar and Arun K. Pujari, Eds., Lecture Notes in Computer Science, Springer, Vol. 5352, 2008, pp. 1- 25, ISBN 978-3-540-89862-7.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.57" class="footnum" href="#fnr.57">57</a></sup> <div class="footpara"><p class="footpara">
Mike Barnett, Bor-Yuh Evan Chang, Robert DeLine, Bart Jacobs and K. Rustan M. Leino, "Boogie: A Modular Reusable Verifier for Object-Oriented Programs," in Proc. 4th international conference on Formal Methods for Components and Objects (FMCO'05), Frank S. de Boer, Marcello M. Bonsangue, Susanne Graf and Willem-Paul de Roever, Eds. Springer, 2006, pp. 364-387, <a href="https://doi.org/10.1007/11804192_17">https://doi.org/10.1007/11804192_17</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.58" class="footnum" href="#fnr.58">58</a></sup> <div class="footpara"><p class="footpara">
"SMT-LIB: The Satisfiability Modulo Theories Library," 1 June 2015. Available: <a href="http://smtlib.cs.uiowa.edu/">http://smtlib.cs.uiowa.edu/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.59" class="footnum" href="#fnr.59">59</a></sup> <div class="footpara"><p class="footpara">
John Whaley, Dzintars Avots, Michael Carbin and Monica S. Lam, "Using Datalog with Binary Decision Diagrams for Program Analysis," 3rd Asian Symposium on Programming Languages and Systems (ASPLAS), Tsukuba, Japan, 3-5 November 2005.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.60" class="footnum" href="#fnr.60">60</a></sup> <div class="footpara"><p class="footpara">
John Rushby, "An Evidential Tool Bus," in Proc. 7th international conference on Formal Methods and Software Engineering (ICFEM'05), Springer, 2005, p. 36, <a href="https://doi.org/10.1007/11576280_3">https://doi.org/10.1007/11576280_3</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.61" class="footnum" href="#fnr.61">61</a></sup> <div class="footpara"><p class="footpara">
Carol Woody, private communication, 17 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.62" class="footnum" href="#fnr.62">62</a></sup> <div class="footpara"><p class="footpara">
"Finding Software Vulnerabilities Before Hackers Do." Available: <a href="https://codedx.com/wp-content/uploads/2015/10/AppSec101-FromCodeDx.pdf">https://codedx.com/wp-content/uploads/2015/10/AppSec101-FromCodeDx.pdf</a> Accessed 8 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.63" class="footnum" href="#fnr.63">63</a></sup> <div class="footpara"><p class="footpara">
VCC verifier. Available: <a href="https://vcc.codeplex.com/">https://vcc.codeplex.com/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.64" class="footnum" href="#fnr.64">64</a></sup> <div class="footpara"><p class="footpara">
Julian Tschannen, Carlo A. Furia, Martin Nordio and Bertrand Meyer, "Verifying Eiffel Programs with Boogie," BOOGIE 2011: First International Workshop on Intermediate Verification Languages, 2011. Available: <a href="https://arxiv.org/abs/1106.4700">https://arxiv.org/abs/1106.4700</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.65" class="footnum" href="#fnr.65">65</a></sup> <div class="footpara"><p class="footpara">
Jean Yang and Chris Hawblitzel, "Safe to the last instruction: automated verification of a type-safe operating system," in Proc. 31st ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI), 2010, pp. 99-110, <a href="https://doi.org/10.1145/1806596.1806610">https://doi.org/10.1145/1806596.1806610</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.66" class="footnum" href="#fnr.66">66</a></sup> <div class="footpara"><p class="footpara">
Sean Barnum, "Software Assurance Findings Expression Schema (SAFES) Overview," January 2012. Available: <a href="https://www.mitre.org/publications/technical-papers/software-assurance-findings-expression-schema-safes-overview">https://www.mitre.org/publications/technical-papers/software-assurance-findings-expression-schema-safes-overview</a> Accessed 8 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.67" class="footnum" href="#fnr.67">67</a></sup> <div class="footpara"><p class="footpara">
George Kastrinis and Yannis Smaragdakis, "Hybrid Context-Sensitivity for Points - To Analysis," Proc. 34th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI '13), 2013, pp. 423-434, <a href="https://doi.org/2499370.2462191">https://doi.org/2499370.2462191</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.68" class="footnum" href="#fnr.68">68</a></sup> <div class="footpara"><p class="footpara">
M. D. McIlroy, "'Mass Produced' Software Components," in Software Engineering, 1968 NATO Conference on Software Engineering, Garmisch, Germany, 7-11 October 1968, pp. 138-150. Available: <a href="http://homepages.cs.ncl.ac.uk/brian.randell/NATO/nato1968.pdf">http://homepages.cs.ncl.ac.uk/brian.randell/NATO/nato1968.pdf</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.69" class="footnum" href="#fnr.69">69</a></sup> <div class="footpara"><p class="footpara">
"TodoMVC: Helping you select an MV* framework." Available: <a href="http://todomvc.com/">http://todomvc.com/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.70" class="footnum" href="#fnr.70">70</a></sup> <div class="footpara"><p class="footpara">
Kent Beck, "Simple Smalltalk testing: with Patterns," The Smalltalk Report, 1994.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.71" class="footnum" href="#fnr.71">71</a></sup> <div class="footpara"><p class="footpara">
Frederick P. Brooks, Jr., The Mythical Man-Month: Essays on Software Engineering, Anniversary Edition, Addison-Wesley Professional, 1995, ISBN: 978-0201835953.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.72" class="footnum" href="#fnr.72">72</a></sup> <div class="footpara"><p class="footpara">
Chris Williams, "How one developer just broke Node, Babel and thousands of projects in 11 lines of JavaScript," 23 March 2016. Available: <a href="http://www.theregister.co.uk/2016/03/23/npm_left_pad_chaos">http://www.theregister.co.uk/2016/03/23/npm_left_pad_chaos</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.73" class="footnum" href="#fnr.73">73</a></sup> <div class="footpara"><p class="footpara">
Butler W. Lampson, "Software Components: Only the Giants Survive," in Computer Systems: Theory, Technology, and Application, Karen I. B. Spaerck Jones and Andrew James Herbert, Eds., Springer, 2004, pp. 137-146, ISBN 978-0-387-20170-2. Available: <a href="http://research.microsoft.com/en-us/um/people/blampson/70-SoftwareComponents/70-SoftwareComponents.pdf">http://research.microsoft.com/en-us/um/people/blampson/70-SoftwareComponents/70-SoftwareComponents.pdf</a> Accessed 24 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.74" class="footnum" href="#fnr.74">74</a></sup> <div class="footpara"><p class="footpara">
Richard P. Gabriel, Patterns of Software: Tales from the Software Community, Oxford Press, Oxford, 1996, ISBN: 0-19-5100269-X.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.75" class="footnum" href="#fnr.75">75</a></sup> <div class="footpara"><p class="footpara">
Erich Gamma, Richard Helm, Ralph Johnson and John Vlissides, Design Patterns: Elements of Reusable Object-Oriented Software, Addison-Wesley Professional, 1995, ISBN: 9788131700075.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.76" class="footnum" href="#fnr.76">76</a></sup> <div class="footpara"><p class="footpara">
Koen Claessen and John Hughes, "Testing Monadic Programs with QuickCheck," SIGPLAN Notices. Vol. 37, Issue 12, 2002, pp. 47-59, <a href="https://doi.org/10.1145/636517.636527">https://doi.org/10.1145/636517.636527</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.77" class="footnum" href="#fnr.77">77</a></sup> <div class="footpara"><p class="footpara">
Richard Kuhn, Raghu Kacker and Yu Lei, "Practical Combinatorial Testing", NIST Special Publication (SP) 800-142, October 2010, <a href="https://doi.org/10.6028/NIST.SP.800-142">https://doi.org/10.6028/NIST.SP.800-142</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.78" class="footnum" href="#fnr.78">78</a></sup> <div class="footpara"><p class="footpara">
Simone Busoli, "Inversion of Control and Dependency Injection with Castle Windsor Container - Part I," 24 July 2007. Available: <a href="http://dotnetslackers.com/articles/designpatterns/InversionOfControlAndDependencyInjectionWi">http://dotnetslackers.com/articles/designpatterns/InversionOfControlAndDependencyInjectionWi</a> thCastleWindsorContainerPart1.aspx Accessed 29 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.79" class="footnum" href="#fnr.79">79</a></sup> <div class="footpara"><p class="footpara">
Vivek Iyer, Amit Kanitkar, Partha Dasgupta and Raghunathan Srinivasan, "Preventing Overflow Attacks by Memory Randomization," IEEE 21st International Symposium on Software Reliability Engineering (ISSRE), November 2010. <a href="https://doi.org/10.1109/ISSRE.2010.22">https://doi.org/10.1109/ISSRE.2010.22</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.80" class="footnum" href="#fnr.80">80</a></sup> <div class="footpara"><p class="footpara">
John Knight, "Helix: Self-regenerative Architecture for the Incorruptible Enterprise," Air Force Office of Scientific Research, AFRL-OSR-VA-TR-2012-1202, 13 November 2012. Available: <a href="http://www.dtic.mil/dtic/tr/fulltext/u2/a579086.pdf">http://www.dtic.mil/dtic/tr/fulltext/u2/a579086.pdf</a> Accessed 20 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.81" class="footnum" href="#fnr.81">81</a></sup> <div class="footpara"><p class="footpara">
"Design and Implementation of Address Space Layout randomization," <a href="https://pax.grsecurity.net/docs/aslr.txt">https://pax.grsecurity.net/docs/aslr.txt</a>, cited in "Address space layout randomization," Wikipedia. Available: <a href="https://en.wikipedia.org/wiki/Address_space_layout_randomization">https://en.wikipedia.org/wiki/Address_space_layout_randomization</a> Accessed 15 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.82" class="footnum" href="#fnr.82">82</a></sup> <div class="footpara"><p class="footpara">
Michael Franz, "E unibus pluram: Massive-Scale Software Diversity as a Defense Mechanism," Proc. New Security Paradigms Workshop (NSPW '10), Concord, MA, 21-23 September 2010, pp. 7-16, <a href="https://doi.org/10.1145/1900546.1900550">https://doi.org/10.1145/1900546.1900550</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.83" class="footnum" href="#fnr.83">83</a></sup> <div class="footpara"><p class="footpara">
Jeff Rowe, Karl N. Levitt, Tufan Demir, Robert Erbacher, "Artificial Diversity as Maneuvers in a Control Theoretic Moving Target Defense," Proc. National Moving Target Research Symposium, Annapolis, MD, June 2012.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.84" class="footnum" href="#fnr.84">84</a></sup> <div class="footpara"><p class="footpara">
Bill Curtis, private communication, 18 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.85" class="footnum" href="#fnr.85">85</a></sup> <div class="footpara"><p class="footpara">
Barti Perini, Stephen Shook and Girish Seshagiri, "Reducing Software Vulnerabilities - The Number One Goal for Every Software Development Organization, Team, and Individual," ISHIPI Technical Report, 22 July 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.86" class="footnum" href="#fnr.86">86</a></sup> <div class="footpara">The web site is <a href="https://samate.nist.gov/SwMM-RSV2016.html">https://samate.nist.gov/SwMM-RSV2016.html</a>.</div></div>

<div class="footdef"><sup><a id="fn.87" class="footnum" href="#fnr.87">87</a></sup> <div class="footpara"><p class="footpara">
Paul E. Black and Elizabeth Fong, "Report of the Workshop on Software Measures and Metrics to Reduce Security Vulnerabilities (SwMM-RSV)," NIST Special Publication (SP) 500-320, October 2016, <a href="https://doi.org/10.6028/NIST.SP.500-320">https://doi.org/10.6028/NIST.SP.500-320</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.88" class="footnum" href="#fnr.88">88</a></sup> <div class="footpara"><p class="footpara">
"ISO/IEC 15939:2007 Systems and software engineering - Measurement process," 2007.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.89" class="footnum" href="#fnr.89">89</a></sup> <div class="footpara"><p class="footpara">
"ISO/IEC 25040:2011 Systems and software engineering - Systems and software Quality Requirements and Evaluation (SQuaRE) - Evaluation process," 2011.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.90" class="footnum" href="#fnr.90">90</a></sup> <div class="footpara"><p class="footpara">
Robert M. Pirsig, Zen and the Art of Motorcycle Maintenance: An Inquiry into Values, William Morrow &amp; Company, New York 1974, ISBN: 9780688002305.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.91" class="footnum" href="#fnr.91">91</a></sup> <div class="footpara"><p class="footpara">
"ISO/IEC 25023:2016 Systems and software engineering - Systems and software Quality Requirements and Evaluation (SQuaRE) - Measurement of system and software product quality," 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.92" class="footnum" href="#fnr.92">92</a></sup> <div class="footpara"><p class="footpara">
Boris Beizer, Software Testing Techniques, 2nd ed., Van Nostrand Reinhold Co., New York, NY, ISBN: 0-442-20672-0.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.93" class="footnum" href="#fnr.93">93</a></sup> <div class="footpara"><p class="footpara">
Vadim Okun, Paul E. Black and Yaacov Yesha, "Comparison of Fault Classes in Specification-Based Testing," Information and Software Technology, Elsevier, Vol. 46, Issue 8, June 2004, pp. 525-533, <a href="https://doi.org/10.1016/j.infsof.2003.10.003">https://doi.org/10.1016/j.infsof.2003.10.003</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.94" class="footnum" href="#fnr.94">94</a></sup> <div class="footpara"><p class="footpara">
Hong Zhu, Patrick A. V. Hall and John H. R. May, "Software unit test coverage and adequacy," ACM Computing Surveys, Vol. 29, Issue 4, December 1997, pp. 366-427, <a href="https://doi.org/10.1145/267580.267590">https://doi.org/10.1145/267580.267590</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.95" class="footnum" href="#fnr.95">95</a></sup> <div class="footpara"><p class="footpara">
"ISO/IEC 25010:2011 Systems and software engineering - Systems and software Quality Requirements and Evaluation (SQuaRE) - System and software quality models," 2011.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.96" class="footnum" href="#fnr.96">96</a></sup> <div class="footpara"><p class="footpara">
Rainer Böhme and Felix C. Freiling, "On Metrics and Measurements," in Irene Eusgeld, Felix Freiling and Ralf H. Reussner, Eds., in Dependability Metrics, Lecture Notes in Computer Science, Vol. 4909, Springer, 2008, pp. 7-13. <a href="https://doi.org/10.1007/978-3-540-68947-8_2">https://doi.org/10.1007/978-3-540-68947-8_2</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.97" class="footnum" href="#fnr.97">97</a></sup> <div class="footpara"><p class="footpara">
Object Management Group, "Automated Source Code Maintainability Measure\x{2122} (ASCMM\x{2122}) V1.0," January 2016. Available: <a href="http://www.omg.org/spec/ASCMM/1.0">http://www.omg.org/spec/ASCMM/1.0</a> Accessed 12 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.98" class="footnum" href="#fnr.98">98</a></sup> <div class="footpara"><p class="footpara">
Harlan D. Mills, Michael Dyer and Richard C. Linger, "Cleanroom Software Engineering," IEEE Software, Vol. 4, Issue 5, 1987, pp. 19-25. Available: <a href="http://trace.tennessee.edu/utk_harlan/18/">http://trace.tennessee.edu/utk_harlan/18/</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.99" class="footnum" href="#fnr.99">99</a></sup> <div class="footpara"><p class="footpara">
Paul E. Black, "Counting Bugs is Harder Than You Think," in Proc. 11th IEEE International Working Conference on Source Code Analysis and Manipulation (SCAM 2011), Williamsburg, VA., 25-26 September 2011, pp. 1-9, <a href="https://doi.org/10.1109/SCAM.2011.24">https://doi.org/10.1109/SCAM.2011.24</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.100" class="footnum" href="#fnr.100">100</a></sup> <div class="footpara"><p class="footpara">
Vadim Okun, Romain Gaucher and Paul E. Black, Eds., "Static Analysis Tool<br  />
Exposition (SATE) 2008," NIST Special Publication (SP) 500-279, June 2009, <a href="https://doi.org/10.6028/NIST.SP.500-279">https://doi.org/10.6028/NIST.SP.500-279</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.101" class="footnum" href="#fnr.101">101</a></sup> <div class="footpara"><p class="footpara">
D. Richard Kuhn, Itzel Dominguez Mendoza, Raghu N. Kacker and Yu Lei, "Combinatorial Coverage Measurement Concepts and Applications," in 2013 IEEE Sixth International Conference on Software Testing, Verification and Validation Workshops (ICSTW 2013), pp. 352-361, <a href="https://doi.org/10.1109/ICSTW.2013.77">https://doi.org/10.1109/ICSTW.2013.77</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.102" class="footnum" href="#fnr.102">102</a></sup> <div class="footpara"><p class="footpara">
D. Richard Kuhn, Raghu N. Kacker and Yu Lei, "Measuring and specifying combinatorial coverage of test input configurations," Innovations in Systems and Software Engineering, Vol. 12, Issue 4, December 2016, pp. 249-261, <a href="https://doi.org/10.1007/s11334-015">https://doi.org/10.1007/s11334-015</a>- 0266-2.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.103" class="footnum" href="#fnr.103">103</a></sup> <div class="footpara"><p class="footpara">
David Flater, Paul E. Black, Elizabeth Fong, Raghu Kacker, Vadim Okun, Stephen Wood and D. Richard Kuhn, "A Rational Foundation for Software Metrology," NIST Internal Report (IR) 8101, January 2016. <a href="https://doi.org/10.6028/NIST.IR.8101">https://doi.org/10.6028/NIST.IR.8101</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.104" class="footnum" href="#fnr.104">104</a></sup> <div class="footpara"><p class="footpara">
John Barnes, "Safe and Secure Software: An Invitation to Ada 2012." Available: <a href="http://www.adacore.com/knowledge/technical-papers/safe-and-secure-software-an-invitation-to-ada-2012">http://www.adacore.com/knowledge/technical-papers/safe-and-secure-software-an-invitation-to-ada-2012</a> Accessed 13 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.105" class="footnum" href="#fnr.105">105</a></sup> <div class="footpara"><p class="footpara">
DARPA, "Cyber Grand Challenge." Available: <a href="https://www.cybergrandchallenge.com/">https://www.cybergrandchallenge.com/</a> Accessed 21 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.106" class="footnum" href="#fnr.106">106</a></sup> <div class="footpara"><p class="footpara">
Yan Wu, H Siy and Robin Gandhi, "Empirical results on the study of software vulnerabilities (NIER track)," in Proc. 33rd International Conference on Software Engineering (ICSE '11), Honolulu, Hawaii, 21-28 May 2011, pp. 964-967, <a href="https://doi.org/10.1145/1985793.1985960">https://doi.org/10.1145/1985793.1985960</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.107" class="footnum" href="#fnr.107">107</a></sup> <div class="footpara"><p class="footpara">
National Initiative for Cybersecurity Education (NICE), "Strategic Plan," April 2016. Available: <a href="http://csrc.nist.gov/nice/about/strategicplan.html">http://csrc.nist.gov/nice/about/strategicplan.html</a> Accessed 20 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.108" class="footnum" href="#fnr.108">108</a></sup> <div class="footpara"><p class="footpara">
David Rice, Geekonomics: The Real Cost of Insecure Software, Addison-Wesley, 2008, ISBN: 978-0321477897.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.109" class="footnum" href="#fnr.109">109</a></sup> <div class="footpara"><p class="footpara">
John R. Marien, Chair, and Robert A. Martin, Co-chair, "Suggested Language to Incorporate Software Assurance Department of Defense Contracts," Department of Defense (DoD) Software Assurance (SwA) Community of Practice (CoP) Contract Language Working Group, February 2016. Available: <a href="http://www.acq.osd.mil/se/docs/2016-02-26-SwA-WorkingPapers.pdf">http://www.acq.osd.mil/se/docs/2016-02-26-SwA-WorkingPapers.pdf</a> Accessed 6 September 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.110" class="footnum" href="#fnr.110">110</a></sup> <div class="footpara"><p class="footpara">
Tom Haigh and Carl Landwehr, "Building Code for Medical Device Software Security," IEEE Cyber Security, 2015. Available: <a href="https://www.computer.org/cms/CYBSI/docs/BCMDSS.pdf">https://www.computer.org/cms/CYBSI/docs/BCMDSS.pdf</a> Accessed 27 October 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.111" class="footnum" href="#fnr.111">111</a></sup> <div class="footpara"><p class="footpara">
Carl Landwehr, "We Need a Building Code for Building Code," Communications of the ACM, Vol. 58 No. 2, February 2015, pp. 24-26, <a href="https://doi.org/10.1145/2700341">https://doi.org/10.1145/2700341</a>.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.112" class="footnum" href="#fnr.112">112</a></sup> <div class="footpara"><p class="footpara">
"Framework for Improving Critical Infrastructure Cybersecurity," Version 1.0, NIST, 12 February 2014. Available: <a href="https://www.nist.gov/document-3766">https://www.nist.gov/document-3766</a> Accessed 7 November 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.113" class="footnum" href="#fnr.113">113</a></sup> <div class="footpara"><p class="footpara">
Fundamental Practices for Secure Software Development: A Guide to the Most Effective Secure Development Practices in Use Today, Stacy Simpson, Ed., 8 October 2008. Available: <a href="http://www.safecode.org/publication/SAFECode_Dev_Practices1108.pdf">http://www.safecode.org/publication/SAFECode_Dev_Practices1108.pdf</a> Accessed 7 November 2016.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.114" class="footnum" href="#fnr.114">114</a></sup> <div class="footpara"><p class="footpara">
Adam Shostack, Threat Modeling: Designing for Security, Wiley and Sons, 2014, ISBN: 978-1-118-80999-0.<br  />
</p></div></div>

<div class="footdef"><sup><a id="fn.115" class="footnum" href="#fnr.115">115</a></sup> <div class="footpara"><p class="footpara">
John Diamant, "Resilient Security Architecture: A Complementary Approach to Re ducing Vulnerabilities," IEEE Security &amp; Privacy, Vol. 9, Issue 4, July/August 2011, pp. 80-84, <a href="https://doi.org/10.1109/MSP.2011.88">https://doi.org/10.1109/MSP.2011.88</a>.<br  />
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2016-12-14 Wed 20:21]</span></span></p>
<p class="author">Author: Ronaldo Ferreira de Lima</p>
<p class="date">Created: 2016-12-19 Mon 09:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
